Appiko/nrf5x-firmware/codebase/ti_opt3101/register_map.h
/**
 *  register_map.h : OPT3101 Register Map.
 *  Copyright (C) 2019  Appiko
 *
 *  This program is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 
 *  You should have received a copy of the GNU General Public License
 *  along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */

#ifndef OPT3101_REGISTER_MAP_H
#define OPT3101_REGISTER_MAP_H
//INITIALIZATION FOR REGISTER DIG_GPO_SEL0
#define DIG_GPO_SEL0			0X0B ///< ADDRESS=11
#define DIG_GPO_SEL0_MSB			3
#define DIG_GPO_SEL0_LSB			0

//INITIALIZATION FOR REGISTER DIG_GPO_SEL1
#define DIG_GPO_SEL1			0X0B ///< ADDRESS=11
#define DIG_GPO_SEL1_MSB			7
#define DIG_GPO_SEL1_LSB			4

//INITIALIZATION FOR REGISTER DIG_GPO_SEL2
#define DIG_GPO_SEL2			0X0B ///< ADDRESS=11
#define DIG_GPO_SEL2_MSB			13
#define DIG_GPO_SEL2_LSB			10

//INITIALIZATION FOR REGISTER DIS_OVL_GATING
#define DIS_OVL_GATING			0X11 ///< ADDRESS=17
#define DIS_OVL_GATING_MSB			15
#define DIS_OVL_GATING_LSB			15

//INITIALIZATION FOR REGISTER PHASE_OUT
#define PHASE_OUT			0X08 ///< ADDRESS=8
#define PHASE_OUT_MSB			15
#define PHASE_OUT_LSB			0

//INITIALIZATION FOR REGISTER PHASE_OVERFLOW
#define PHASE_OVERFLOW			0X08 ///< ADDRESS=8
#define PHASE_OVERFLOW_MSB			16
#define PHASE_OVERFLOW_LSB			16

//INITIALIZATION FOR REGISTER HDR_MODE
#define HDR_MODE			0X08 ///< ADDRESS=8
#define HDR_MODE_MSB			17
#define HDR_MODE_LSB			17

//INITIALIZATION FOR REGISTER TX_CHANNEL
#define TX_CHANNEL			0X08 ///< ADDRESS=8
#define TX_CHANNEL_MSB			19
#define TX_CHANNEL_LSB			18

//INITIALIZATION FOR REGISTER FRAME_STATUS
#define FRAME_STATUS			0X08 ///< ADDRESS=8
#define FRAME_STATUS_MSB			20
#define FRAME_STATUS_LSB			20

//INITIALIZATION FOR REGISTER MOD_FREQ
#define MOD_FREQ			0X08 ///< ADDRESS=8
#define MOD_FREQ_MSB			21
#define MOD_FREQ_LSB			21

//INITIALIZATION FOR REGISTER FRAME_COUNT0
#define FRAME_COUNT0			0X08 ///< ADDRESS=8
#define FRAME_COUNT0_MSB			23
#define FRAME_COUNT0_LSB			23

//INITIALIZATION FOR REGISTER AMP_OUT
#define AMP_OUT			0X09 ///< ADDRESS=9
#define AMP_OUT_MSB			15
#define AMP_OUT_LSB			0

//INITIALIZATION FOR REGISTER FRAME_COUNT1
#define FRAME_COUNT1			0X09 ///< ADDRESS=9
#define FRAME_COUNT1_MSB			17
#define FRAME_COUNT1_LSB			16

//INITIALIZATION FOR REGISTER SIG_OVL_FLAG
#define SIG_OVL_FLAG			0X09 ///< ADDRESS=9
#define SIG_OVL_FLAG_MSB			18
#define SIG_OVL_FLAG_LSB			18

//INITIALIZATION FOR REGISTER DEALIAS_BIN
#define DEALIAS_BIN			0X09 ///< ADDRESS=9
#define DEALIAS_BIN_MSB			23
#define DEALIAS_BIN_LSB			20

//INITIALIZATION FOR REGISTER FRAME_COUNT2
#define FRAME_COUNT2			0X0A ///< ADDRESS=10
#define FRAME_COUNT2_MSB			1
#define FRAME_COUNT2_LSB			0

//INITIALIZATION FOR REGISTER AMB_DATA
#define AMB_DATA			0X0A ///< ADDRESS=10
#define AMB_DATA_MSB			11
#define AMB_DATA_LSB			2

//INITIALIZATION FOR REGISTER TMAIN
#define TMAIN			0X0A ///< ADDRESS=10
#define TMAIN_MSB			23
#define TMAIN_LSB			12

//INITIALIZATION FOR REGISTER AMPLITUDE_MIN_THR
#define AMPLITUDE_MIN_THR_1			0X10 ///< ADDRESS=16
#define AMPLITUDE_MIN_THR_MSB_1			23
#define AMPLITUDE_MIN_THR_LSB_1			16
#define AMPLITUDE_MIN_THR			0X11 ///< ADDRESS=17
#define AMPLITUDE_MIN_THR_MSB			23
#define AMPLITUDE_MIN_THR_LSB			16

//INITIALIZATION FOR REGISTER AMB_OVL_FLAG
#define AMB_OVL_FLAG			0X08 ///< ADDRESS=8
#define AMB_OVL_FLAG_MSB			22
#define AMB_OVL_FLAG_LSB			22

//INITIALIZATION FOR REGISTER PHASE_OVERFLOW_F2
#define PHASE_OVERFLOW_F2			0X09 ///< ADDRESS=9
#define PHASE_OVERFLOW_F2_MSB			19
#define PHASE_OVERFLOW_F2_LSB			19

//INITIALIZATION FOR REGISTER REF_COUNT_LIMIT
#define REF_COUNT_LIMIT			0X0F ///< ADDRESS=15
#define REF_COUNT_LIMIT_MSB			14
#define REF_COUNT_LIMIT_LSB			0

//INITIALIZATION FOR REGISTER START_FREQ_CALIB
#define START_FREQ_CALIB			0X0F ///< ADDRESS=15
#define START_FREQ_CALIB_MSB			16
#define START_FREQ_CALIB_LSB			16

//INITIALIZATION FOR REGISTER SYS_CLK_DIVIDER
#define SYS_CLK_DIVIDER			0X0F ///< ADDRESS=15
#define SYS_CLK_DIVIDER_MSB			20
#define SYS_CLK_DIVIDER_LSB			17

//INITIALIZATION FOR REGISTER FREQ_COUNT_READ_REG
#define FREQ_COUNT_READ_REG			0X10 ///< ADDRESS=16
#define FREQ_COUNT_READ_REG_MSB			14
#define FREQ_COUNT_READ_REG_LSB			0

//INITIALIZATION FOR REGISTER FREQ_COUNT_REG
#define FREQ_COUNT_REG			0X11 ///< ADDRESS=17
#define FREQ_COUNT_REG_MSB			14
#define FREQ_COUNT_REG_LSB			0

//INITIALIZATION FOR REGISTER EN_AUTO_FREQ_COUNT
#define EN_AUTO_FREQ_COUNT			0X0F ///< ADDRESS=15
#define EN_AUTO_FREQ_COUNT_MSB			21
#define EN_AUTO_FREQ_COUNT_LSB			21

//INITIALIZATION FOR REGISTER EN_FLOOP
#define EN_FLOOP			0X0F ///< ADDRESS=15
#define EN_FLOOP_MSB			22
#define EN_FLOOP_LSB			22

//INITIALIZATION FOR REGISTER EN_FREQ_CORR
#define EN_FREQ_CORR			0X0F ///< ADDRESS=15
#define EN_FREQ_CORR_MSB			23
#define EN_FREQ_CORR_LSB			23

//INITIALIZATION FOR REGISTER EN_CONT_FCALIB
#define EN_CONT_FCALIB			0X10 ///< ADDRESS=16
#define EN_CONT_FCALIB_MSB			15
#define EN_CONT_FCALIB_LSB			15

//INITIALIZATION FOR REGISTER MONOSHOT_BIT
#define MONOSHOT_BIT			0X00 ///< ADDRESS=0
#define MONOSHOT_BIT_MSB			23
#define MONOSHOT_BIT_LSB			23

//INITIALIZATION FOR REGISTER MONOSHOT_MODE
#define MONOSHOT_MODE			0X27 ///< ADDRESS=39
#define MONOSHOT_MODE_MSB			1
#define MONOSHOT_MODE_LSB			0

//INITIALIZATION FOR REGISTER POWERUP_DELAY
#define POWERUP_DELAY			0X26 ///< ADDRESS=38
#define POWERUP_DELAY_MSB			23
#define POWERUP_DELAY_LSB			10

//INITIALIZATION FOR REGISTER MONOSHOT_NUMFRAME
#define MONOSHOT_NUMFRAME			0X27 ///< ADDRESS=39
#define MONOSHOT_NUMFRAME_MSB			7
#define MONOSHOT_NUMFRAME_LSB			2

//INITIALIZATION FOR REGISTER MONOSHOT_FZ_CLKCNT
#define MONOSHOT_FZ_CLKCNT			0X27 ///< ADDRESS=39
#define MONOSHOT_FZ_CLKCNT_MSB			23
#define MONOSHOT_FZ_CLKCNT_LSB			8

//INITIALIZATION FOR REGISTER EN_TX_SWITCH
#define EN_TX_SWITCH			0X2A ///< ADDRESS=42
#define EN_TX_SWITCH_MSB			0
#define EN_TX_SWITCH_LSB			0

//INITIALIZATION FOR REGISTER SEL_TX_CH
#define SEL_TX_CH			0X2A ///< ADDRESS=42
#define SEL_TX_CH_MSB			2
#define SEL_TX_CH_LSB			1

//INITIALIZATION FOR REGISTER TX_SEQ_REG
#define TX_SEQ_REG			0X2A ///< ADDRESS=42
#define TX_SEQ_REG_MSB			14
#define TX_SEQ_REG_LSB			3

//INITIALIZATION FOR REGISTER EN_ADAPTIVE_HDR
#define EN_ADAPTIVE_HDR			0X2A ///< ADDRESS=42
#define EN_ADAPTIVE_HDR_MSB			15
#define EN_ADAPTIVE_HDR_LSB			15

