Appiko/nrf5x-firmware/codebase/ti_opt3101/register_map.h
//INITIALIZATION FOR REGISTER SEL_HDR_MODE
#define SEL_HDR_MODE			0X2A ///< ADDRESS=42
#define SEL_HDR_MODE_MSB			16
#define SEL_HDR_MODE_LSB			16

//INITIALIZATION FOR REGISTER HDR_THR_LOW
#define HDR_THR_LOW			0X2C ///< ADDRESS=44
#define HDR_THR_LOW_MSB			15
#define HDR_THR_LOW_LSB			0

//INITIALIZATION FOR REGISTER HDR_THR_HIGH
#define HDR_THR_HIGH			0X2B ///< ADDRESS=43
#define HDR_THR_HIGH_MSB			15
#define HDR_THR_HIGH_LSB			0

//INITIALIZATION FOR REGISTER ILLUM_SCALE_L_TX0
#define ILLUM_SCALE_L_TX0			0X2B ///< ADDRESS=43
#define ILLUM_SCALE_L_TX0_MSB			18
#define ILLUM_SCALE_L_TX0_LSB			16

//INITIALIZATION FOR REGISTER ILLUM_DAC_L_TX0
#define ILLUM_DAC_L_TX0			0X29 ///< ADDRESS=41
#define ILLUM_DAC_L_TX0_MSB			4
#define ILLUM_DAC_L_TX0_LSB			0

//INITIALIZATION FOR REGISTER ILLUM_SCALE_H_TX0
#define ILLUM_SCALE_H_TX0			0X2B ///< ADDRESS=43
#define ILLUM_SCALE_H_TX0_MSB			21
#define ILLUM_SCALE_H_TX0_LSB			19

//INITIALIZATION FOR REGISTER ILLUM_DAC_H_TX0
#define ILLUM_DAC_H_TX0			0X29 ///< ADDRESS=41
#define ILLUM_DAC_H_TX0_MSB			9
#define ILLUM_DAC_H_TX0_LSB			5

//INITIALIZATION FOR REGISTER ILLUM_SCALE_L_TX1
#define ILLUM_SCALE_L_TX1			0X2C ///< ADDRESS=44
#define ILLUM_SCALE_L_TX1_MSB			18
#define ILLUM_SCALE_L_TX1_LSB			16

//INITIALIZATION FOR REGISTER ILLUM_DAC_L_TX1
#define ILLUM_DAC_L_TX1			0X29 ///< ADDRESS=41
#define ILLUM_DAC_L_TX1_MSB			14
#define ILLUM_DAC_L_TX1_LSB			10

//INITIALIZATION FOR REGISTER ILLUM_SCALE_H_TX1
#define ILLUM_SCALE_H_TX1			0X2C ///< ADDRESS=44
#define ILLUM_SCALE_H_TX1_MSB			21
#define ILLUM_SCALE_H_TX1_LSB			19

//INITIALIZATION FOR REGISTER ILLUM_DAC_H_TX1
#define ILLUM_DAC_H_TX1			0X29 ///< ADDRESS=41
#define ILLUM_DAC_H_TX1_MSB			19
#define ILLUM_DAC_H_TX1_LSB			15

//INITIALIZATION FOR REGISTER ILLUM_SCALE_L_TX2
#define ILLUM_SCALE_L_TX2			0XB9 ///< ADDRESS=185
#define ILLUM_SCALE_L_TX2_MSB			20
#define ILLUM_SCALE_L_TX2_LSB			18

//INITIALIZATION FOR REGISTER ILLUM_DAC_L_TX2
#define ILLUM_DAC_L_TX2_1			0X29 ///< ADDRESS=41
#define ILLUM_DAC_L_TX2_MSB_1			23
#define ILLUM_DAC_L_TX2_LSB_1			20
#define ILLUM_DAC_L_TX2			0X2A ///< ADDRESS=42
#define ILLUM_DAC_L_TX2_MSB			23
#define ILLUM_DAC_L_TX2_LSB			23

//INITIALIZATION FOR REGISTER ILLUM_SCALE_H_TX2
#define ILLUM_SCALE_H_TX2			0XB9 ///< ADDRESS=185
#define ILLUM_SCALE_H_TX2_MSB			23
#define ILLUM_SCALE_H_TX2_LSB			21

//INITIALIZATION FOR REGISTER ILLUM_DAC_H_TX2
#define ILLUM_DAC_H_TX2			0X2A ///< ADDRESS=42
#define ILLUM_DAC_H_TX2_MSB			22
#define ILLUM_DAC_H_TX2_LSB			18

//INITIALIZATION FOR REGISTER AMB_ADC_IN_TX0
#define AMB_ADC_IN_TX0			0XB9 ///< ADDRESS=185
#define AMB_ADC_IN_TX0_MSB			13
#define AMB_ADC_IN_TX0_LSB			12

//INITIALIZATION FOR REGISTER AMB_ADC_IN_TX1
#define AMB_ADC_IN_TX1			0XB9 ///< ADDRESS=185
#define AMB_ADC_IN_TX1_MSB			15
#define AMB_ADC_IN_TX1_LSB			14

//INITIALIZATION FOR REGISTER AMB_ADC_IN_TX2
#define AMB_ADC_IN_TX2			0XB9 ///< ADDRESS=185
#define AMB_ADC_IN_TX2_MSB			17
#define AMB_ADC_IN_TX2_LSB			16

//INITIALIZATION FOR REGISTER GIVE_DEALIAS_DATA
#define GIVE_DEALIAS_DATA			0XB8 ///< ADDRESS=184
#define GIVE_DEALIAS_DATA_MSB			20
#define GIVE_DEALIAS_DATA_LSB			20

//INITIALIZATION FOR REGISTER EN_DEALIAS_MEAS
#define EN_DEALIAS_MEAS			0X40 ///< ADDRESS=64
#define EN_DEALIAS_MEAS_MSB			0
#define EN_DEALIAS_MEAS_LSB			0

//INITIALIZATION FOR REGISTER NCR_CONFIG
#define NCR_CONFIG			0X40 ///< ADDRESS=64
#define NCR_CONFIG_MSB			21
#define NCR_CONFIG_LSB			21

//INITIALIZATION FOR REGISTER ALPHA0_DEALIAS_SCALE
#define ALPHA0_DEALIAS_SCALE			0X40 ///< ADDRESS=64
#define ALPHA0_DEALIAS_SCALE_MSB			14
#define ALPHA0_DEALIAS_SCALE_LSB			9

//INITIALIZATION FOR REGISTER BETA0_DEALIAS_SCALE
#define BETA0_DEALIAS_SCALE			0X40 ///< ADDRESS=64
#define BETA0_DEALIAS_SCALE_MSB			20
#define BETA0_DEALIAS_SCALE_LSB			15

//INITIALIZATION FOR REGISTER ALPHA1_DEALIAS_SCALE
#define ALPHA1_DEALIAS_SCALE			0X41 ///< ADDRESS=65
#define ALPHA1_DEALIAS_SCALE_MSB			5
#define ALPHA1_DEALIAS_SCALE_LSB			0

//INITIALIZATION FOR REGISTER BETA1_DEALIAS_SCALE
#define BETA1_DEALIAS_SCALE			0X41 ///< ADDRESS=65
#define BETA1_DEALIAS_SCALE_MSB			11
#define BETA1_DEALIAS_SCALE_LSB			6

//INITIALIZATION FOR REGISTER EN_MULTI_FREQ_PHASE
#define EN_MULTI_FREQ_PHASE			0X40 ///< ADDRESS=64
#define EN_MULTI_FREQ_PHASE_MSB			22
#define EN_MULTI_FREQ_PHASE_LSB			22

//INITIALIZATION FOR REGISTER TEMP_AVG_MAIN
#define TEMP_AVG_MAIN			0X03 ///< ADDRESS=3
#define TEMP_AVG_MAIN_MSB			23
#define TEMP_AVG_MAIN_LSB			22

//INITIALIZATION FOR REGISTER DIS_OVL_FOR_HDR_METH1
#define DIS_OVL_FOR_HDR_METH1			0XB8 ///< ADDRESS=184
#define DIS_OVL_FOR_HDR_METH1_MSB			21
#define DIS_OVL_FOR_HDR_METH1_LSB			21

//INITIALIZATION FOR REGISTER EN_OVL_FOR_HDR_METH2
#define EN_OVL_FOR_HDR_METH2			0XB8 ///< ADDRESS=184
#define EN_OVL_FOR_HDR_METH2_MSB			22
#define EN_OVL_FOR_HDR_METH2_LSB			22

//INITIALIZATION FOR REGISTER EN_TX1_ON_TX0
#define EN_TX1_ON_TX0			0XB9 ///< ADDRESS=185
#define EN_TX1_ON_TX0_MSB			10
#define EN_TX1_ON_TX0_LSB			10

//INITIALIZATION FOR REGISTER EN_TX2_ON_TX0
#define EN_TX2_ON_TX0			0XB9 ///< ADDRESS=185
#define EN_TX2_ON_TX0_MSB			11
#define EN_TX2_ON_TX0_LSB			11

//INITIALIZATION FOR REGISTER CLIP_MODE_FC
#define CLIP_MODE_FC			0X50 ///< ADDRESS=80
#define CLIP_MODE_FC_MSB			0
#define CLIP_MODE_FC_LSB			0

//INITIALIZATION FOR REGISTER CLIP_MODE_NL
#define CLIP_MODE_NL			0X50 ///< ADDRESS=80
#define CLIP_MODE_NL_MSB			1
#define CLIP_MODE_NL_LSB			1

//INITIALIZATION FOR REGISTER CLIP_MODE_TEMP
#define CLIP_MODE_TEMP			0X50 ///< ADDRESS=80
#define CLIP_MODE_TEMP_MSB			2
#define CLIP_MODE_TEMP_LSB			2

//INITIALIZATION FOR REGISTER CLIP_MODE_OFFSET
#define CLIP_MODE_OFFSET			0X50 ///< ADDRESS=80
#define CLIP_MODE_OFFSET_MSB			3
#define CLIP_MODE_OFFSET_LSB			3

//INITIALIZATION FOR REGISTER DISABLE_SYNCING
#define DISABLE_SYNCING			0X50 ///< ADDRESS=80
#define DISABLE_SYNCING_MSB			21
#define DISABLE_SYNCING_LSB			21

//INITIALIZATION FOR REGISTER FORCE_EN_SLAVE
#define FORCE_EN_SLAVE			0X00 ///< ADDRESS=0
#define FORCE_EN_SLAVE_MSB			22
#define FORCE_EN_SLAVE_LSB			22

