Appiko/nrf5x-firmware/codebase/ti_opt3101/register_map.h
//INITIALIZATION FOR REGISTER FORCE_EN_BYPASS
#define FORCE_EN_BYPASS			0X00 ///< ADDRESS=0
#define FORCE_EN_BYPASS_MSB			21
#define FORCE_EN_BYPASS_LSB			21

//INITIALIZATION FOR REGISTER OVERRIDE_CLKGEN_REG
#define OVERRIDE_CLKGEN_REG			0X50 ///< ADDRESS=80
#define OVERRIDE_CLKGEN_REG_MSB			22
#define OVERRIDE_CLKGEN_REG_LSB			22

//INITIALIZATION FOR REGISTER SOFTWARE_RESET
#define SOFTWARE_RESET			0X00 ///< ADDRESS=0
#define SOFTWARE_RESET_MSB			0
#define SOFTWARE_RESET_LSB			0

//INITIALIZATION FOR REGISTER DIS_TG_ACONF
#define DIS_TG_ACONF			0X80 ///< ADDRESS=128
#define DIS_TG_ACONF_MSB			23
#define DIS_TG_ACONF_LSB			23

//INITIALIZATION FOR REGISTER CAPTURE_CLK_CNT
#define CAPTURE_CLK_CNT			0XA0 ///< ADDRESS=160
#define CAPTURE_CLK_CNT_MSB			15
#define CAPTURE_CLK_CNT_LSB			0

//INITIALIZATION FOR REGISTER TG_EN
#define TG_EN			0X80 ///< ADDRESS=128
#define TG_EN_MSB			0
#define TG_EN_LSB			0

//INITIALIZATION FOR REGISTER NUM_SUB_FRAMES
#define NUM_SUB_FRAMES			0X9F ///< ADDRESS=159
#define NUM_SUB_FRAMES_MSB			11
#define NUM_SUB_FRAMES_LSB			0

//INITIALIZATION FOR REGISTER NUM_AVG_SUB_FRAMES
#define NUM_AVG_SUB_FRAMES			0X9F ///< ADDRESS=159
#define NUM_AVG_SUB_FRAMES_MSB			23
#define NUM_AVG_SUB_FRAMES_LSB			12

//INITIALIZATION FOR REGISTER SUB_VD_CLK_CNT
#define SUB_VD_CLK_CNT			0X80 ///< ADDRESS=128
#define SUB_VD_CLK_CNT_MSB			16
#define SUB_VD_CLK_CNT_LSB			1

//INITIALIZATION FOR REGISTER TG_ILLUMEN_START
#define TG_ILLUMEN_START			0X8F ///< ADDRESS=143
#define TG_ILLUMEN_START_MSB			15
#define TG_ILLUMEN_START_LSB			0

//INITIALIZATION FOR REGISTER TG_ILLUMEN_END
#define TG_ILLUMEN_END			0X90 ///< ADDRESS=144
#define TG_ILLUMEN_END_MSB			15
#define TG_ILLUMEN_END_LSB			0

//INITIALIZATION FOR REGISTER TG_ILLUMEN_MASK_START
#define TG_ILLUMEN_MASK_START			0X9C ///< ADDRESS=156
#define TG_ILLUMEN_MASK_START_MSB			11
#define TG_ILLUMEN_MASK_START_LSB			0

//INITIALIZATION FOR REGISTER TG_ILLUMEN_MASK_END
#define TG_ILLUMEN_MASK_END			0X9C ///< ADDRESS=156
#define TG_ILLUMEN_MASK_END_MSB			23
#define TG_ILLUMEN_MASK_END_LSB			12

//INITIALIZATION FOR REGISTER TG_AFE_RST_START
#define TG_AFE_RST_START			0X83 ///< ADDRESS=131
#define TG_AFE_RST_START_MSB			15
#define TG_AFE_RST_START_LSB			0

//INITIALIZATION FOR REGISTER TG_AFE_RST_END
#define TG_AFE_RST_END			0X84 ///< ADDRESS=132
#define TG_AFE_RST_END_MSB			15
#define TG_AFE_RST_END_LSB			0

//INITIALIZATION FOR REGISTER TG_SEQ_INT_START
#define TG_SEQ_INT_START			0X85 ///< ADDRESS=133
#define TG_SEQ_INT_START_MSB			15
#define TG_SEQ_INT_START_LSB			0

//INITIALIZATION FOR REGISTER TG_SEQ_INT_END
#define TG_SEQ_INT_END			0X86 ///< ADDRESS=134
#define TG_SEQ_INT_END_MSB			15
#define TG_SEQ_INT_END_LSB			0

//INITIALIZATION FOR REGISTER TG_CAPTURE_START
#define TG_CAPTURE_START			0X87 ///< ADDRESS=135
#define TG_CAPTURE_START_MSB			15
#define TG_CAPTURE_START_LSB			0

//INITIALIZATION FOR REGISTER TG_CAPTURE_END
#define TG_CAPTURE_END			0X88 ///< ADDRESS=136
#define TG_CAPTURE_END_MSB			15
#define TG_CAPTURE_END_LSB			0

//INITIALIZATION FOR REGISTER TG_OVL_WINDOW_START
#define TG_OVL_WINDOW_START			0X89 ///< ADDRESS=137
#define TG_OVL_WINDOW_START_MSB			15
#define TG_OVL_WINDOW_START_LSB			0

//INITIALIZATION FOR REGISTER TG_OVL_WINDOW_END
#define TG_OVL_WINDOW_END			0X8A ///< ADDRESS=138
#define TG_OVL_WINDOW_END_MSB			15
#define TG_OVL_WINDOW_END_LSB			0

//INITIALIZATION FOR REGISTER TG_CALC_START
#define TG_CALC_START			0X91 ///< ADDRESS=145
#define TG_CALC_START_MSB			15
#define TG_CALC_START_LSB			0

//INITIALIZATION FOR REGISTER TG_CALC_END
#define TG_CALC_END			0X92 ///< ADDRESS=146
#define TG_CALC_END_MSB			15
#define TG_CALC_END_LSB			0

//INITIALIZATION FOR REGISTER TG_DYNPDN_START
#define TG_DYNPDN_START			0X93 ///< ADDRESS=147
#define TG_DYNPDN_START_MSB			15
#define TG_DYNPDN_START_LSB			0

//INITIALIZATION FOR REGISTER TG_DYNPDN_END
#define TG_DYNPDN_END			0X94 ///< ADDRESS=148
#define TG_DYNPDN_END_MSB			15
#define TG_DYNPDN_END_LSB			0

//INITIALIZATION FOR REGISTER TG_SEQ_INT_MASK_START
#define TG_SEQ_INT_MASK_START			0X97 ///< ADDRESS=151
#define TG_SEQ_INT_MASK_START_MSB			11
#define TG_SEQ_INT_MASK_START_LSB			0

//INITIALIZATION FOR REGISTER TG_SEQ_INT_MASK_END
#define TG_SEQ_INT_MASK_END			0X97 ///< ADDRESS=151
#define TG_SEQ_INT_MASK_END_MSB			23
#define TG_SEQ_INT_MASK_END_LSB			12

//INITIALIZATION FOR REGISTER TG_CAPTURE_MASK_START
#define TG_CAPTURE_MASK_START			0X98 ///< ADDRESS=152
#define TG_CAPTURE_MASK_START_MSB			11
#define TG_CAPTURE_MASK_START_LSB			0

//INITIALIZATION FOR REGISTER TG_CAPTURE_MASK_END
#define TG_CAPTURE_MASK_END			0X98 ///< ADDRESS=152
#define TG_CAPTURE_MASK_END_MSB			23
#define TG_CAPTURE_MASK_END_LSB			12

//INITIALIZATION FOR REGISTER TG_OVL_WINDOW_MASK_START
#define TG_OVL_WINDOW_MASK_START			0X99 ///< ADDRESS=153
#define TG_OVL_WINDOW_MASK_START_MSB			11
#define TG_OVL_WINDOW_MASK_START_LSB			0

//INITIALIZATION FOR REGISTER TG_OVL_WINDOW_MASK_END
#define TG_OVL_WINDOW_MASK_END			0X99 ///< ADDRESS=153
#define TG_OVL_WINDOW_MASK_END_MSB			23
#define TG_OVL_WINDOW_MASK_END_LSB			12

//INITIALIZATION FOR REGISTER TG_CALC_MASK_START
#define TG_CALC_MASK_START			0X9D ///< ADDRESS=157
#define TG_CALC_MASK_START_MSB			11
#define TG_CALC_MASK_START_LSB			0

//INITIALIZATION FOR REGISTER TG_CALC_MASK_END
#define TG_CALC_MASK_END			0X9D ///< ADDRESS=157
#define TG_CALC_MASK_END_MSB			23
#define TG_CALC_MASK_END_LSB			12

//INITIALIZATION FOR REGISTER TG_DYNPDN_MASK_START
#define TG_DYNPDN_MASK_START			0X9E ///< ADDRESS=158
#define TG_DYNPDN_MASK_START_MSB			11
#define TG_DYNPDN_MASK_START_LSB			0

//INITIALIZATION FOR REGISTER TG_DYNPDN_MASK_END
#define TG_DYNPDN_MASK_END			0X9E ///< ADDRESS=158
#define TG_DYNPDN_MASK_END_MSB			23
#define TG_DYNPDN_MASK_END_LSB			12

//INITIALIZATION FOR REGISTER EN_SEQUENCER
#define EN_SEQUENCER			0X14 ///< ADDRESS=20
#define EN_SEQUENCER_MSB			16
#define EN_SEQUENCER_LSB			16

//INITIALIZATION FOR REGISTER EN_PROCESSOR_VALUES
#define EN_PROCESSOR_VALUES			0X14 ///< ADDRESS=20
#define EN_PROCESSOR_VALUES_MSB			17
#define EN_PROCESSOR_VALUES_LSB			17

//INITIALIZATION FOR REGISTER STATUS_IN_REG
#define STATUS_IN_REG			0X14 ///< ADDRESS=20
#define STATUS_IN_REG_MSB			18
#define STATUS_IN_REG_LSB			18

//INITIALIZATION FOR REGISTER MUX_SEL_COMPIN
#define MUX_SEL_COMPIN			0X13 ///< ADDRESS=19
#define MUX_SEL_COMPIN_MSB			2
#define MUX_SEL_COMPIN_LSB			0

//INITIALIZATION FOR REGISTER COMPARE_REG1
#define COMPARE_REG1			0X13 ///< ADDRESS=19
#define COMPARE_REG1_MSB			18
#define COMPARE_REG1_LSB			3

