Appiko/nrf5x-firmware/codebase/ti_opt3101/register_map.h
//INITIALIZATION FOR REGISTER COMPARE_REG2
#define COMPARE_REG2			0X14 ///< ADDRESS=20
#define COMPARE_REG2_MSB			15
#define COMPARE_REG2_LSB			0

//INITIALIZATION FOR REGISTER DIS_INTERRUPT
#define DIS_INTERRUPT			0X14 ///< ADDRESS=20
#define DIS_INTERRUPT_MSB			19
#define DIS_INTERRUPT_LSB			19

//INITIALIZATION FOR REGISTER COMMAND0
#define COMMAND0			0X15 ///< ADDRESS=21
#define COMMAND0_MSB			11
#define COMMAND0_LSB			0

//INITIALIZATION FOR REGISTER COMMAND1
#define COMMAND1			0X15 ///< ADDRESS=21
#define COMMAND1_MSB			23
#define COMMAND1_LSB			12

//INITIALIZATION FOR REGISTER COMMAND2
#define COMMAND2			0X16 ///< ADDRESS=22
#define COMMAND2_MSB			11
#define COMMAND2_LSB			0

//INITIALIZATION FOR REGISTER COMMAND3
#define COMMAND3			0X16 ///< ADDRESS=22
#define COMMAND3_MSB			23
#define COMMAND3_LSB			12

//INITIALIZATION FOR REGISTER COMMAND4
#define COMMAND4			0X17 ///< ADDRESS=23
#define COMMAND4_MSB			11
#define COMMAND4_LSB			0

//INITIALIZATION FOR REGISTER COMMAND5
#define COMMAND5			0X17 ///< ADDRESS=23
#define COMMAND5_MSB			23
#define COMMAND5_LSB			12

//INITIALIZATION FOR REGISTER COMMAND6
#define COMMAND6			0X18 ///< ADDRESS=24
#define COMMAND6_MSB			11
#define COMMAND6_LSB			0

//INITIALIZATION FOR REGISTER COMMAND7
#define COMMAND7			0X18 ///< ADDRESS=24
#define COMMAND7_MSB			23
#define COMMAND7_LSB			12

//INITIALIZATION FOR REGISTER COMMAND8
#define COMMAND8			0X19 ///< ADDRESS=25
#define COMMAND8_MSB			11
#define COMMAND8_LSB			0

//INITIALIZATION FOR REGISTER COMMAND9
#define COMMAND9			0X19 ///< ADDRESS=25
#define COMMAND9_MSB			23
#define COMMAND9_LSB			12

//INITIALIZATION FOR REGISTER COMMAND10
#define COMMAND10			0X1A ///< ADDRESS=26
#define COMMAND10_MSB			11
#define COMMAND10_LSB			0

//INITIALIZATION FOR REGISTER COMMAND11
#define COMMAND11			0X1A ///< ADDRESS=26
#define COMMAND11_MSB			23
#define COMMAND11_LSB			12

//INITIALIZATION FOR REGISTER COMMAND12
#define COMMAND12			0X1B ///< ADDRESS=27
#define COMMAND12_MSB			11
#define COMMAND12_LSB			0

//INITIALIZATION FOR REGISTER COMMAND13
#define COMMAND13			0X1B ///< ADDRESS=27
#define COMMAND13_MSB			23
#define COMMAND13_LSB			12

//INITIALIZATION FOR REGISTER COMMAND14
#define COMMAND14			0X1C ///< ADDRESS=28
#define COMMAND14_MSB			11
#define COMMAND14_LSB			0

//INITIALIZATION FOR REGISTER COMMAND15
#define COMMAND15			0X1C ///< ADDRESS=28
#define COMMAND15_MSB			23
#define COMMAND15_LSB			12

//INITIALIZATION FOR REGISTER COMMAND16
#define COMMAND16			0X1D ///< ADDRESS=29
#define COMMAND16_MSB			11
#define COMMAND16_LSB			0

//INITIALIZATION FOR REGISTER COMMAND17
#define COMMAND17			0X1D ///< ADDRESS=29
#define COMMAND17_MSB			23
#define COMMAND17_LSB			12

//INITIALIZATION FOR REGISTER COMMAND18
#define COMMAND18			0X1E ///< ADDRESS=30
#define COMMAND18_MSB			11
#define COMMAND18_LSB			0

//INITIALIZATION FOR REGISTER COMMAND19
#define COMMAND19			0X1E ///< ADDRESS=30
#define COMMAND19_MSB			23
#define COMMAND19_LSB			12

//INITIALIZATION FOR REGISTER FORCE_SCALE_VAL
#define FORCE_SCALE_VAL			0X2E ///< ADDRESS=46
#define FORCE_SCALE_VAL_MSB			2
#define FORCE_SCALE_VAL_LSB			0

//INITIALIZATION FOR REGISTER DIS_AUTO_SCALE
#define DIS_AUTO_SCALE			0X2E ///< ADDRESS=46
#define DIS_AUTO_SCALE_MSB			3
#define DIS_AUTO_SCALE_LSB			3

//INITIALIZATION FOR REGISTER DISABLE_CONF_RESCALE
#define DISABLE_CONF_RESCALE			0X2E ///< ADDRESS=46
#define DISABLE_CONF_RESCALE_MSB			13
#define DISABLE_CONF_RESCALE_LSB			13

//INITIALIZATION FOR REGISTER INT_XTALK_CALIB
#define INT_XTALK_CALIB			0X2E ///< ADDRESS=46
#define INT_XTALK_CALIB_MSB			4
#define INT_XTALK_CALIB_LSB			4

//INITIALIZATION FOR REGISTER XTALK_FILT_TIME_CONST
#define XTALK_FILT_TIME_CONST			0X2E ///< ADDRESS=46
#define XTALK_FILT_TIME_CONST_MSB			23
#define XTALK_FILT_TIME_CONST_LSB			20

//INITIALIZATION FOR REGISTER USE_XTALK_FILT_INT
#define USE_XTALK_FILT_INT			0X2E ///< ADDRESS=46
#define USE_XTALK_FILT_INT_MSB			5
#define USE_XTALK_FILT_INT_LSB			5

//INITIALIZATION FOR REGISTER USE_XTALK_REG_INT
#define USE_XTALK_REG_INT			0X2E ///< ADDRESS=46
#define USE_XTALK_REG_INT_MSB			6
#define USE_XTALK_REG_INT_LSB			6

//INITIALIZATION FOR REGISTER IQ_READ_DATA_SEL
#define IQ_READ_DATA_SEL			0X2E ///< ADDRESS=46
#define IQ_READ_DATA_SEL_MSB			11
#define IQ_READ_DATA_SEL_LSB			9

//INITIALIZATION FOR REGISTER IPHASE_XTALK
#define IPHASE_XTALK			0X3B ///< ADDRESS=59
#define IPHASE_XTALK_MSB			23
#define IPHASE_XTALK_LSB			0

//INITIALIZATION FOR REGISTER QPHASE_XTALK
#define QPHASE_XTALK			0X3C ///< ADDRESS=60
#define QPHASE_XTALK_MSB			23
#define QPHASE_XTALK_LSB			0

//INITIALIZATION FOR REGISTER INT_XTALK_REG_SCALE
#define INT_XTALK_REG_SCALE			0X2E ///< ADDRESS=46
#define INT_XTALK_REG_SCALE_MSB			16
#define INT_XTALK_REG_SCALE_LSB			14

//INITIALIZATION FOR REGISTER IPHASE_XTALK_INT_REG
#define IPHASE_XTALK_INT_REG			0X3D ///< ADDRESS=61
#define IPHASE_XTALK_INT_REG_MSB			15
#define IPHASE_XTALK_INT_REG_LSB			0

//INITIALIZATION FOR REGISTER QPHASE_XTALK_INT_REG
#define QPHASE_XTALK_INT_REG			0X3E ///< ADDRESS=62
#define QPHASE_XTALK_INT_REG_MSB			15
#define QPHASE_XTALK_INT_REG_LSB			0

//INITIALIZATION FOR REGISTER ILLUM_XTALK_CALIB
#define ILLUM_XTALK_CALIB			0X2E ///< ADDRESS=46
#define ILLUM_XTALK_CALIB_MSB			12
#define ILLUM_XTALK_CALIB_LSB			12

//INITIALIZATION FOR REGISTER ILLUM_XTALK_REG_SCALE
#define ILLUM_XTALK_REG_SCALE			0X2E ///< ADDRESS=46
#define ILLUM_XTALK_REG_SCALE_MSB			19
#define ILLUM_XTALK_REG_SCALE_LSB			17

//INITIALIZATION FOR REGISTER USE_XTALK_FILT_ILLUM
#define USE_XTALK_FILT_ILLUM			0X2E ///< ADDRESS=46
#define USE_XTALK_FILT_ILLUM_MSB			7
#define USE_XTALK_FILT_ILLUM_LSB			7

//INITIALIZATION FOR REGISTER USE_XTALK_REG_ILLUM
#define USE_XTALK_REG_ILLUM			0X2E ///< ADDRESS=46
#define USE_XTALK_REG_ILLUM_MSB			8
#define USE_XTALK_REG_ILLUM_LSB			8

