Appiko/nrf5x-firmware/codebase/ti_opt3101/register_map.h
//INITIALIZATION FOR REGISTER IPHASE_XTALK_REG_HDR0_TX0
#define IPHASE_XTALK_REG_HDR0_TX0			0X2F ///< ADDRESS=47
#define IPHASE_XTALK_REG_HDR0_TX0_MSB			15
#define IPHASE_XTALK_REG_HDR0_TX0_LSB			0

//INITIALIZATION FOR REGISTER QPHASE_XTALK_REG_HDR0_TX0
#define QPHASE_XTALK_REG_HDR0_TX0			0X30 ///< ADDRESS=48
#define QPHASE_XTALK_REG_HDR0_TX0_MSB			15
#define QPHASE_XTALK_REG_HDR0_TX0_LSB			0

//INITIALIZATION FOR REGISTER IPHASE_XTALK_REG_HDR1_TX0
#define IPHASE_XTALK_REG_HDR1_TX0			0X31 ///< ADDRESS=49
#define IPHASE_XTALK_REG_HDR1_TX0_MSB			15
#define IPHASE_XTALK_REG_HDR1_TX0_LSB			0

//INITIALIZATION FOR REGISTER QPHASE_XTALK_REG_HDR1_TX0
#define QPHASE_XTALK_REG_HDR1_TX0			0X32 ///< ADDRESS=50
#define QPHASE_XTALK_REG_HDR1_TX0_MSB			15
#define QPHASE_XTALK_REG_HDR1_TX0_LSB			0

//INITIALIZATION FOR REGISTER IPHASE_XTALK_REG_HDR0_TX1
#define IPHASE_XTALK_REG_HDR0_TX1			0X33 ///< ADDRESS=51
#define IPHASE_XTALK_REG_HDR0_TX1_MSB			15
#define IPHASE_XTALK_REG_HDR0_TX1_LSB			0

//INITIALIZATION FOR REGISTER QPHASE_XTALK_REG_HDR0_TX1
#define QPHASE_XTALK_REG_HDR0_TX1			0X34 ///< ADDRESS=52
#define QPHASE_XTALK_REG_HDR0_TX1_MSB			15
#define QPHASE_XTALK_REG_HDR0_TX1_LSB			0

//INITIALIZATION FOR REGISTER IPHASE_XTALK_REG_HDR1_TX1
#define IPHASE_XTALK_REG_HDR1_TX1			0X35 ///< ADDRESS=53
#define IPHASE_XTALK_REG_HDR1_TX1_MSB			15
#define IPHASE_XTALK_REG_HDR1_TX1_LSB			0

//INITIALIZATION FOR REGISTER QPHASE_XTALK_REG_HDR1_TX1
#define QPHASE_XTALK_REG_HDR1_TX1			0X36 ///< ADDRESS=54
#define QPHASE_XTALK_REG_HDR1_TX1_MSB			15
#define QPHASE_XTALK_REG_HDR1_TX1_LSB			0

//INITIALIZATION FOR REGISTER IPHASE_XTALK_REG_HDR0_TX2
#define IPHASE_XTALK_REG_HDR0_TX2			0X37 ///< ADDRESS=55
#define IPHASE_XTALK_REG_HDR0_TX2_MSB			15
#define IPHASE_XTALK_REG_HDR0_TX2_LSB			0

//INITIALIZATION FOR REGISTER QPHASE_XTALK_REG_HDR0_TX2
#define QPHASE_XTALK_REG_HDR0_TX2			0X38 ///< ADDRESS=56
#define QPHASE_XTALK_REG_HDR0_TX2_MSB			15
#define QPHASE_XTALK_REG_HDR0_TX2_LSB			0

//INITIALIZATION FOR REGISTER IPHASE_XTALK_REG_HDR1_TX2
#define IPHASE_XTALK_REG_HDR1_TX2			0X39 ///< ADDRESS=57
#define IPHASE_XTALK_REG_HDR1_TX2_MSB			15
#define IPHASE_XTALK_REG_HDR1_TX2_LSB			0

//INITIALIZATION FOR REGISTER QPHASE_XTALK_REG_HDR1_TX2
#define QPHASE_XTALK_REG_HDR1_TX2			0X3A ///< ADDRESS=58
#define QPHASE_XTALK_REG_HDR1_TX2_MSB			15
#define QPHASE_XTALK_REG_HDR1_TX2_LSB			0

//INITIALIZATION FOR REGISTER EN_TEMP_XTALK_CORR
#define EN_TEMP_XTALK_CORR			0X3A ///< ADDRESS=58
#define EN_TEMP_XTALK_CORR_MSB			16
#define EN_TEMP_XTALK_CORR_LSB			16

//INITIALIZATION FOR REGISTER SCALE_TEMP_COEFF_XTALK
#define SCALE_TEMP_COEFF_XTALK			0X3A ///< ADDRESS=58
#define SCALE_TEMP_COEFF_XTALK_MSB			19
#define SCALE_TEMP_COEFF_XTALK_LSB			17

//INITIALIZATION FOR REGISTER TEMP_COEFF_XTALK_IPHASE_HDR0_TX0
#define TEMP_COEFF_XTALK_IPHASE_HDR0_TX0			0X38 ///< ADDRESS=56
#define TEMP_COEFF_XTALK_IPHASE_HDR0_TX0_MSB			23
#define TEMP_COEFF_XTALK_IPHASE_HDR0_TX0_LSB			16

//INITIALIZATION FOR REGISTER TEMP_COEFF_XTALK_QPHASE_HDR0_TX0
#define TEMP_COEFF_XTALK_QPHASE_HDR0_TX0			0X39 ///< ADDRESS=57
#define TEMP_COEFF_XTALK_QPHASE_HDR0_TX0_MSB			23
#define TEMP_COEFF_XTALK_QPHASE_HDR0_TX0_LSB			16

//INITIALIZATION FOR REGISTER TEMP_COEFF_XTALK_IPHASE_HDR1_TX0
#define TEMP_COEFF_XTALK_IPHASE_HDR1_TX0			0X5E ///< ADDRESS=94
#define TEMP_COEFF_XTALK_IPHASE_HDR1_TX0_MSB			15
#define TEMP_COEFF_XTALK_IPHASE_HDR1_TX0_LSB			8

//INITIALIZATION FOR REGISTER TEMP_COEFF_XTALK_QPHASE_HDR1_TX0
#define TEMP_COEFF_XTALK_QPHASE_HDR1_TX0			0X60 ///< ADDRESS=96
#define TEMP_COEFF_XTALK_QPHASE_HDR1_TX0_MSB			7
#define TEMP_COEFF_XTALK_QPHASE_HDR1_TX0_LSB			0

//INITIALIZATION FOR REGISTER TEMP_COEFF_XTALK_IPHASE_HDR0_TX1
#define TEMP_COEFF_XTALK_IPHASE_HDR0_TX1			0X5E ///< ADDRESS=94
#define TEMP_COEFF_XTALK_IPHASE_HDR0_TX1_MSB			23
#define TEMP_COEFF_XTALK_IPHASE_HDR0_TX1_LSB			16

//INITIALIZATION FOR REGISTER TEMP_COEFF_XTALK_QPHASE_HDR0_TX1
#define TEMP_COEFF_XTALK_QPHASE_HDR0_TX1			0X60 ///< ADDRESS=96
#define TEMP_COEFF_XTALK_QPHASE_HDR0_TX1_MSB			15
#define TEMP_COEFF_XTALK_QPHASE_HDR0_TX1_LSB			8

//INITIALIZATION FOR REGISTER TEMP_COEFF_XTALK_IPHASE_HDR1_TX1
#define TEMP_COEFF_XTALK_IPHASE_HDR1_TX1			0X5F ///< ADDRESS=95
#define TEMP_COEFF_XTALK_IPHASE_HDR1_TX1_MSB			7
#define TEMP_COEFF_XTALK_IPHASE_HDR1_TX1_LSB			0

//INITIALIZATION FOR REGISTER TEMP_COEFF_XTALK_QPHASE_HDR1_TX1
#define TEMP_COEFF_XTALK_QPHASE_HDR1_TX1			0X60 ///< ADDRESS=96
#define TEMP_COEFF_XTALK_QPHASE_HDR1_TX1_MSB			23
#define TEMP_COEFF_XTALK_QPHASE_HDR1_TX1_LSB			16

//INITIALIZATION FOR REGISTER TEMP_COEFF_XTALK_IPHASE_HDR0_TX2
#define TEMP_COEFF_XTALK_IPHASE_HDR0_TX2			0X5F ///< ADDRESS=95
#define TEMP_COEFF_XTALK_IPHASE_HDR0_TX2_MSB			15
#define TEMP_COEFF_XTALK_IPHASE_HDR0_TX2_LSB			8

//INITIALIZATION FOR REGISTER TEMP_COEFF_XTALK_QPHASE_HDR0_TX2
#define TEMP_COEFF_XTALK_QPHASE_HDR0_TX2			0X61 ///< ADDRESS=97
#define TEMP_COEFF_XTALK_QPHASE_HDR0_TX2_MSB			7
#define TEMP_COEFF_XTALK_QPHASE_HDR0_TX2_LSB			0

//INITIALIZATION FOR REGISTER TEMP_COEFF_XTALK_IPHASE_HDR1_TX2
#define TEMP_COEFF_XTALK_IPHASE_HDR1_TX2			0X5F ///< ADDRESS=95
#define TEMP_COEFF_XTALK_IPHASE_HDR1_TX2_MSB			23
#define TEMP_COEFF_XTALK_IPHASE_HDR1_TX2_LSB			16

//INITIALIZATION FOR REGISTER TEMP_COEFF_XTALK_QPHASE_HDR1_TX2
#define TEMP_COEFF_XTALK_QPHASE_HDR1_TX2			0X61 ///< ADDRESS=97
#define TEMP_COEFF_XTALK_QPHASE_HDR1_TX2_MSB			15
#define TEMP_COEFF_XTALK_QPHASE_HDR1_TX2_LSB			8

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR0_TX0
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR0_TX0			0X36 ///< ADDRESS=54
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR0_TX0_MSB			23
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR0_TX0_LSB			16

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR0_TX0
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR0_TX0			0X37 ///< ADDRESS=55
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR0_TX0_MSB			23
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR0_TX0_LSB			16

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR1_TX0
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR1_TX0			0X5B ///< ADDRESS=91
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR1_TX0_MSB			7
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR1_TX0_LSB			0

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR0_TX1
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR0_TX1			0X5B ///< ADDRESS=91
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR0_TX1_MSB			15
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR0_TX1_LSB			8

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR1_TX1
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR1_TX1			0X5B ///< ADDRESS=91
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR1_TX1_MSB			23
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR1_TX1_LSB			16

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR0_TX2
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR0_TX2			0X5C ///< ADDRESS=92
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR0_TX2_MSB			7
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR0_TX2_LSB			0

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR1_TX2
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR1_TX2			0X5C ///< ADDRESS=92
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR1_TX2_MSB			15
#define TEMP_COEFF_ILLUM_XTALK_IPHASE_HDR1_TX2_LSB			8

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR1_TX0
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR1_TX0			0X5C ///< ADDRESS=92
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR1_TX0_MSB			23
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR1_TX0_LSB			16

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR0_TX1
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR0_TX1			0X5D ///< ADDRESS=93
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR0_TX1_MSB			7
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR0_TX1_LSB			0

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR1_TX1
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR1_TX1			0X5D ///< ADDRESS=93
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR1_TX1_MSB			15
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR1_TX1_LSB			8

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR0_TX2
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR0_TX2			0X5D ///< ADDRESS=93
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR0_TX2_MSB			23
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR0_TX2_LSB			16

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR1_TX2
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR1_TX2			0X5E ///< ADDRESS=94
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR1_TX2_MSB			7
#define TEMP_COEFF_ILLUM_XTALK_QPHASE_HDR1_TX2_LSB			0

//INITIALIZATION FOR REGISTER AMB_XTALK_QPHASE_COEFF
#define AMB_XTALK_QPHASE_COEFF			0X0C ///< ADDRESS=12
#define AMB_XTALK_QPHASE_COEFF_MSB			15
#define AMB_XTALK_QPHASE_COEFF_LSB			8

//INITIALIZATION FOR REGISTER AMB_XTALK_IPHASE_COEFF
#define AMB_XTALK_IPHASE_COEFF			0X0C ///< ADDRESS=12
#define AMB_XTALK_IPHASE_COEFF_MSB			7
#define AMB_XTALK_IPHASE_COEFF_LSB			0

//INITIALIZATION FOR REGISTER SCALE_AMB_COEFF_XTALK
#define SCALE_AMB_COEFF_XTALK			0X3A ///< ADDRESS=58
#define SCALE_AMB_COEFF_XTALK_MSB			22
#define SCALE_AMB_COEFF_XTALK_LSB			20

//INITIALIZATION FOR REGISTER EN_PHASE_CORR
#define EN_PHASE_CORR			0X43 ///< ADDRESS=67
#define EN_PHASE_CORR_MSB			0
#define EN_PHASE_CORR_LSB			0

