Appiko/nrf5x-firmware/codebase/ti_opt3101/register_map.h
//INITIALIZATION FOR REGISTER PHASE_OFFSET_HDR0_TX0
#define PHASE_OFFSET_HDR0_TX0			0X42 ///< ADDRESS=66
#define PHASE_OFFSET_HDR0_TX0_MSB			15
#define PHASE_OFFSET_HDR0_TX0_LSB			0

//INITIALIZATION FOR REGISTER PHASE_OFFSET_HDR1_TX0
#define PHASE_OFFSET_HDR1_TX0			0X51 ///< ADDRESS=81
#define PHASE_OFFSET_HDR1_TX0_MSB			15
#define PHASE_OFFSET_HDR1_TX0_LSB			0

//INITIALIZATION FOR REGISTER PHASE_OFFSET_HDR0_TX1
#define PHASE_OFFSET_HDR0_TX1			0X52 ///< ADDRESS=82
#define PHASE_OFFSET_HDR0_TX1_MSB			15
#define PHASE_OFFSET_HDR0_TX1_LSB			0

//INITIALIZATION FOR REGISTER PHASE_OFFSET_HDR1_TX1
#define PHASE_OFFSET_HDR1_TX1			0X53 ///< ADDRESS=83
#define PHASE_OFFSET_HDR1_TX1_MSB			15
#define PHASE_OFFSET_HDR1_TX1_LSB			0

//INITIALIZATION FOR REGISTER PHASE_OFFSET_HDR0_TX2
#define PHASE_OFFSET_HDR0_TX2			0X54 ///< ADDRESS=84
#define PHASE_OFFSET_HDR0_TX2_MSB			15
#define PHASE_OFFSET_HDR0_TX2_LSB			0

//INITIALIZATION FOR REGISTER PHASE_OFFSET_HDR1_TX2
#define PHASE_OFFSET_HDR1_TX2			0X55 ///< ADDRESS=85
#define PHASE_OFFSET_HDR1_TX2_MSB			15
#define PHASE_OFFSET_HDR1_TX2_LSB			0

//INITIALIZATION FOR REGISTER REVERSE_PHASE_BEFORE_OFFSET
#define REVERSE_PHASE_BEFORE_OFFSET			0X43 ///< ADDRESS=67
#define REVERSE_PHASE_BEFORE_OFFSET_MSB			9
#define REVERSE_PHASE_BEFORE_OFFSET_LSB			9

//INITIALIZATION FOR REGISTER PHASE2_OFFSET_HDR0_TX0
#define PHASE2_OFFSET_HDR0_TX0			0X44 ///< ADDRESS=68
#define PHASE2_OFFSET_HDR0_TX0_MSB			15
#define PHASE2_OFFSET_HDR0_TX0_LSB			0

//INITIALIZATION FOR REGISTER PHASE2_OFFSET_HDR1_TX0
#define PHASE2_OFFSET_HDR1_TX0			0X56 ///< ADDRESS=86
#define PHASE2_OFFSET_HDR1_TX0_MSB			15
#define PHASE2_OFFSET_HDR1_TX0_LSB			0

//INITIALIZATION FOR REGISTER PHASE2_OFFSET_HDR0_TX1
#define PHASE2_OFFSET_HDR0_TX1			0X57 ///< ADDRESS=87
#define PHASE2_OFFSET_HDR0_TX1_MSB			15
#define PHASE2_OFFSET_HDR0_TX1_LSB			0

//INITIALIZATION FOR REGISTER PHASE2_OFFSET_HDR1_TX1
#define PHASE2_OFFSET_HDR1_TX1			0X58 ///< ADDRESS=88
#define PHASE2_OFFSET_HDR1_TX1_MSB			15
#define PHASE2_OFFSET_HDR1_TX1_LSB			0

//INITIALIZATION FOR REGISTER PHASE2_OFFSET_HDR0_TX2
#define PHASE2_OFFSET_HDR0_TX2			0X59 ///< ADDRESS=89
#define PHASE2_OFFSET_HDR0_TX2_MSB			15
#define PHASE2_OFFSET_HDR0_TX2_LSB			0

//INITIALIZATION FOR REGISTER PHASE2_OFFSET_HDR1_TX2
#define PHASE2_OFFSET_HDR1_TX2			0X5A ///< ADDRESS=90
#define PHASE2_OFFSET_HDR1_TX2_MSB			15
#define PHASE2_OFFSET_HDR1_TX2_LSB			0

//INITIALIZATION FOR REGISTER EN_TEMP_CORR
#define EN_TEMP_CORR			0X43 ///< ADDRESS=67
#define EN_TEMP_CORR_MSB			1
#define EN_TEMP_CORR_LSB			1

//INITIALIZATION FOR REGISTER SCALE_PHASE_TEMP_COEFF
#define SCALE_PHASE_TEMP_COEFF			0X43 ///< ADDRESS=67
#define SCALE_PHASE_TEMP_COEFF_MSB			8
#define SCALE_PHASE_TEMP_COEFF_LSB			6

//INITIALIZATION FOR REGISTER TMAIN_CALIB_HDR0_TX0
#define TMAIN_CALIB_HDR0_TX0			0X47 ///< ADDRESS=71
#define TMAIN_CALIB_HDR0_TX0_MSB			11
#define TMAIN_CALIB_HDR0_TX0_LSB			0

//INITIALIZATION FOR REGISTER TEMP_COEFF_MAIN_HDR0_TX0
#define TEMP_COEFF_MAIN_HDR0_TX0			0X45 ///< ADDRESS=69
#define TEMP_COEFF_MAIN_HDR0_TX0_MSB			11
#define TEMP_COEFF_MAIN_HDR0_TX0_LSB			0

//INITIALIZATION FOR REGISTER TMAIN_CALIB_HDR1_TX0
#define TMAIN_CALIB_HDR1_TX0			0X48 ///< ADDRESS=72
#define TMAIN_CALIB_HDR1_TX0_MSB			11
#define TMAIN_CALIB_HDR1_TX0_LSB			0

//INITIALIZATION FOR REGISTER TEMP_COEFF_MAIN_HDR1_TX0
#define TEMP_COEFF_MAIN_HDR1_TX0			0X2D ///< ADDRESS=45
#define TEMP_COEFF_MAIN_HDR1_TX0_MSB			11
#define TEMP_COEFF_MAIN_HDR1_TX0_LSB			0

//INITIALIZATION FOR REGISTER TMAIN_CALIB_HDR0_TX1
#define TMAIN_CALIB_HDR0_TX1			0X49 ///< ADDRESS=73
#define TMAIN_CALIB_HDR0_TX1_MSB			11
#define TMAIN_CALIB_HDR0_TX1_LSB			0

//INITIALIZATION FOR REGISTER TEMP_COEFF_MAIN_HDR0_TX1
#define TEMP_COEFF_MAIN_HDR0_TX1			0X2D ///< ADDRESS=45
#define TEMP_COEFF_MAIN_HDR0_TX1_MSB			23
#define TEMP_COEFF_MAIN_HDR0_TX1_LSB			12

//INITIALIZATION FOR REGISTER TMAIN_CALIB_HDR1_TX1
#define TMAIN_CALIB_HDR1_TX1			0X41 ///< ADDRESS=65
#define TMAIN_CALIB_HDR1_TX1_MSB			23
#define TMAIN_CALIB_HDR1_TX1_LSB			12

//INITIALIZATION FOR REGISTER TEMP_COEFF_MAIN_HDR1_TX1
#define TEMP_COEFF_MAIN_HDR1_TX1_1			0X2F ///< ADDRESS=47
#define TEMP_COEFF_MAIN_HDR1_TX1_MSB_1			23
#define TEMP_COEFF_MAIN_HDR1_TX1_LSB_1			16
#define TEMP_COEFF_MAIN_HDR1_TX1			0X30 ///< ADDRESS=48
#define TEMP_COEFF_MAIN_HDR1_TX1_MSB			23
#define TEMP_COEFF_MAIN_HDR1_TX1_LSB			20

//INITIALIZATION FOR REGISTER TMAIN_CALIB_HDR0_TX2
#define TMAIN_CALIB_HDR0_TX2			0X3F ///< ADDRESS=63
#define TMAIN_CALIB_HDR0_TX2_MSB			11
#define TMAIN_CALIB_HDR0_TX2_LSB			0

//INITIALIZATION FOR REGISTER TEMP_COEFF_MAIN_HDR0_TX2
#define TEMP_COEFF_MAIN_HDR0_TX2_1			0X31 ///< ADDRESS=49
#define TEMP_COEFF_MAIN_HDR0_TX2_MSB_1			23
#define TEMP_COEFF_MAIN_HDR0_TX2_LSB_1			16
#define TEMP_COEFF_MAIN_HDR0_TX2			0X32 ///< ADDRESS=50
#define TEMP_COEFF_MAIN_HDR0_TX2_MSB			23
#define TEMP_COEFF_MAIN_HDR0_TX2_LSB			20

//INITIALIZATION FOR REGISTER TMAIN_CALIB_HDR1_TX2
#define TMAIN_CALIB_HDR1_TX2			0X45 ///< ADDRESS=69
#define TMAIN_CALIB_HDR1_TX2_MSB			23
#define TMAIN_CALIB_HDR1_TX2_LSB			12

//INITIALIZATION FOR REGISTER TEMP_COEFF_MAIN_HDR1_TX2
#define TEMP_COEFF_MAIN_HDR1_TX2_1			0X33 ///< ADDRESS=51
#define TEMP_COEFF_MAIN_HDR1_TX2_MSB_1			23
#define TEMP_COEFF_MAIN_HDR1_TX2_LSB_1			16
#define TEMP_COEFF_MAIN_HDR1_TX2			0X34 ///< ADDRESS=52
#define TEMP_COEFF_MAIN_HDR1_TX2_MSB			23
#define TEMP_COEFF_MAIN_HDR1_TX2_LSB			20

//INITIALIZATION FOR REGISTER TILLUM_CALIB_HDR0_TX0
#define TILLUM_CALIB_HDR0_TX0			0X47 ///< ADDRESS=71
#define TILLUM_CALIB_HDR0_TX0_MSB			23
#define TILLUM_CALIB_HDR0_TX0_LSB			12

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_HDR0_TX0
#define TEMP_COEFF_ILLUM_HDR0_TX0			0X46 ///< ADDRESS=70
#define TEMP_COEFF_ILLUM_HDR0_TX0_MSB			11
#define TEMP_COEFF_ILLUM_HDR0_TX0_LSB			0

//INITIALIZATION FOR REGISTER TILLUM_CALIB_HDR1_TX0
#define TILLUM_CALIB_HDR1_TX0			0X48 ///< ADDRESS=72
#define TILLUM_CALIB_HDR1_TX0_MSB			23
#define TILLUM_CALIB_HDR1_TX0_LSB			12

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_HDR1_TX0
#define TEMP_COEFF_ILLUM_HDR1_TX0_1			0X51 ///< ADDRESS=81
#define TEMP_COEFF_ILLUM_HDR1_TX0_MSB_1			23
#define TEMP_COEFF_ILLUM_HDR1_TX0_LSB_1			16
#define TEMP_COEFF_ILLUM_HDR1_TX0			0X52 ///< ADDRESS=82
#define TEMP_COEFF_ILLUM_HDR1_TX0_MSB			23
#define TEMP_COEFF_ILLUM_HDR1_TX0_LSB			20

//INITIALIZATION FOR REGISTER TILLUM_CALIB_HDR0_TX1
#define TILLUM_CALIB_HDR0_TX1			0X49 ///< ADDRESS=73
#define TILLUM_CALIB_HDR0_TX1_MSB			23
#define TILLUM_CALIB_HDR0_TX1_LSB			12

