Appiko/nrf5x-firmware/codebase/ti_opt3101/register_map.h
//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_HDR0_TX1
#define TEMP_COEFF_ILLUM_HDR0_TX1_1			0X53 ///< ADDRESS=83
#define TEMP_COEFF_ILLUM_HDR0_TX1_MSB_1			23
#define TEMP_COEFF_ILLUM_HDR0_TX1_LSB_1			16
#define TEMP_COEFF_ILLUM_HDR0_TX1			0X54 ///< ADDRESS=84
#define TEMP_COEFF_ILLUM_HDR0_TX1_MSB			23
#define TEMP_COEFF_ILLUM_HDR0_TX1_LSB			20

//INITIALIZATION FOR REGISTER TILLUM_CALIB_HDR1_TX1
#define TILLUM_CALIB_HDR1_TX1			0X43 ///< ADDRESS=67
#define TILLUM_CALIB_HDR1_TX1_MSB			23
#define TILLUM_CALIB_HDR1_TX1_LSB			12

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_HDR1_TX1
#define TEMP_COEFF_ILLUM_HDR1_TX1_1			0X55 ///< ADDRESS=85
#define TEMP_COEFF_ILLUM_HDR1_TX1_MSB_1			23
#define TEMP_COEFF_ILLUM_HDR1_TX1_LSB_1			16
#define TEMP_COEFF_ILLUM_HDR1_TX1			0X56 ///< ADDRESS=86
#define TEMP_COEFF_ILLUM_HDR1_TX1_MSB			23
#define TEMP_COEFF_ILLUM_HDR1_TX1_LSB			20

//INITIALIZATION FOR REGISTER TILLUM_CALIB_HDR0_TX2
#define TILLUM_CALIB_HDR0_TX2			0X3F ///< ADDRESS=63
#define TILLUM_CALIB_HDR0_TX2_MSB			23
#define TILLUM_CALIB_HDR0_TX2_LSB			12

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_HDR0_TX2
#define TEMP_COEFF_ILLUM_HDR0_TX2_1			0X57 ///< ADDRESS=87
#define TEMP_COEFF_ILLUM_HDR0_TX2_MSB_1			23
#define TEMP_COEFF_ILLUM_HDR0_TX2_LSB_1			16
#define TEMP_COEFF_ILLUM_HDR0_TX2			0X58 ///< ADDRESS=88
#define TEMP_COEFF_ILLUM_HDR0_TX2_MSB			23
#define TEMP_COEFF_ILLUM_HDR0_TX2_LSB			20

//INITIALIZATION FOR REGISTER TILLUM_CALIB_HDR1_TX2
#define TILLUM_CALIB_HDR1_TX2			0X46 ///< ADDRESS=70
#define TILLUM_CALIB_HDR1_TX2_MSB			23
#define TILLUM_CALIB_HDR1_TX2_LSB			12

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_HDR1_TX2
#define TEMP_COEFF_ILLUM_HDR1_TX2_1			0X59 ///< ADDRESS=89
#define TEMP_COEFF_ILLUM_HDR1_TX2_MSB_1			23
#define TEMP_COEFF_ILLUM_HDR1_TX2_LSB_1			16
#define TEMP_COEFF_ILLUM_HDR1_TX2			0X5A ///< ADDRESS=90
#define TEMP_COEFF_ILLUM_HDR1_TX2_MSB			23
#define TEMP_COEFF_ILLUM_HDR1_TX2_LSB			20

//INITIALIZATION FOR REGISTER AMB_SAT_THR
#define AMB_SAT_THR			0X0D ///< ADDRESS=13
#define AMB_SAT_THR_MSB			16
#define AMB_SAT_THR_LSB			7

//INITIALIZATION FOR REGISTER AMB_CALIB
#define AMB_CALIB			0X0B ///< ADDRESS=11
#define AMB_CALIB_MSB			23
#define AMB_CALIB_LSB			14

//INITIALIZATION FOR REGISTER AMB_PHASE_CORR_PWL_COEFF0
#define AMB_PHASE_CORR_PWL_COEFF0			0X0C ///< ADDRESS=12
#define AMB_PHASE_CORR_PWL_COEFF0_MSB			23
#define AMB_PHASE_CORR_PWL_COEFF0_LSB			16

//INITIALIZATION FOR REGISTER AMB_PHASE_CORR_PWL_X0
#define AMB_PHASE_CORR_PWL_X0			0XB8 ///< ADDRESS=184
#define AMB_PHASE_CORR_PWL_X0_MSB			9
#define AMB_PHASE_CORR_PWL_X0_LSB			0

//INITIALIZATION FOR REGISTER AMB_PHASE_CORR_PWL_X1
#define AMB_PHASE_CORR_PWL_X1			0XB8 ///< ADDRESS=184
#define AMB_PHASE_CORR_PWL_X1_MSB			19
#define AMB_PHASE_CORR_PWL_X1_LSB			10

//INITIALIZATION FOR REGISTER AMB_PHASE_CORR_PWL_X2
#define AMB_PHASE_CORR_PWL_X2			0XB9 ///< ADDRESS=185
#define AMB_PHASE_CORR_PWL_X2_MSB			9
#define AMB_PHASE_CORR_PWL_X2_LSB			0

//INITIALIZATION FOR REGISTER AMB_PHASE_CORR_PWL_COEFF1
#define AMB_PHASE_CORR_PWL_COEFF1			0XB4 ///< ADDRESS=180
#define AMB_PHASE_CORR_PWL_COEFF1_MSB			7
#define AMB_PHASE_CORR_PWL_COEFF1_LSB			0

//INITIALIZATION FOR REGISTER AMB_PHASE_CORR_PWL_COEFF2
#define AMB_PHASE_CORR_PWL_COEFF2			0XB4 ///< ADDRESS=180
#define AMB_PHASE_CORR_PWL_COEFF2_MSB			15
#define AMB_PHASE_CORR_PWL_COEFF2_LSB			8

//INITIALIZATION FOR REGISTER AMB_PHASE_CORR_PWL_COEFF3
#define AMB_PHASE_CORR_PWL_COEFF3			0XB4 ///< ADDRESS=180
#define AMB_PHASE_CORR_PWL_COEFF3_MSB			23
#define AMB_PHASE_CORR_PWL_COEFF3_LSB			16

//INITIALIZATION FOR REGISTER SCALE_AMB_PHASE_CORR_COEFF
#define SCALE_AMB_PHASE_CORR_COEFF			0XB5 ///< ADDRESS=181
#define SCALE_AMB_PHASE_CORR_COEFF_MSB			2
#define SCALE_AMB_PHASE_CORR_COEFF_LSB			0

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_SQUARE_HDR0
#define TEMP_COEFF_ILLUM_SQUARE_HDR0			0XB6 ///< ADDRESS=182
#define TEMP_COEFF_ILLUM_SQUARE_HDR0_MSB			7
#define TEMP_COEFF_ILLUM_SQUARE_HDR0_LSB			0

//INITIALIZATION FOR REGISTER TEMP_COEFF_ILLUM_SQUARE_HDR1
#define TEMP_COEFF_ILLUM_SQUARE_HDR1			0XB6 ///< ADDRESS=182
#define TEMP_COEFF_ILLUM_SQUARE_HDR1_MSB			15
#define TEMP_COEFF_ILLUM_SQUARE_HDR1_LSB			8

//INITIALIZATION FOR REGISTER TEMP_COEFF_MAIN_SQUARE_HDR0
#define TEMP_COEFF_MAIN_SQUARE_HDR0			0XB7 ///< ADDRESS=183
#define TEMP_COEFF_MAIN_SQUARE_HDR0_MSB			7
#define TEMP_COEFF_MAIN_SQUARE_HDR0_LSB			0

//INITIALIZATION FOR REGISTER TEMP_COEFF_MAIN_SQUARE_HDR1
#define TEMP_COEFF_MAIN_SQUARE_HDR1			0XB7 ///< ADDRESS=183
#define TEMP_COEFF_MAIN_SQUARE_HDR1_MSB			15
#define TEMP_COEFF_MAIN_SQUARE_HDR1_LSB			8

//INITIALIZATION FOR REGISTER SCALE_PHASE_TEMP_CORR_SQUARE
#define SCALE_PHASE_TEMP_CORR_SQUARE			0XB5 ///< ADDRESS=181
#define SCALE_PHASE_TEMP_CORR_SQUARE_MSB			5
#define SCALE_PHASE_TEMP_CORR_SQUARE_LSB			3

//INITIALIZATION FOR REGISTER EN_NL_CORR
#define EN_NL_CORR			0X4A ///< ADDRESS=74
#define EN_NL_CORR_MSB			0
#define EN_NL_CORR_LSB			0

//INITIALIZATION FOR REGISTER A1_COEFF_HDR0_TX0
#define A1_COEFF_HDR0_TX0			0X4B ///< ADDRESS=75
#define A1_COEFF_HDR0_TX0_MSB			15
#define A1_COEFF_HDR0_TX0_LSB			0

//INITIALIZATION FOR REGISTER A2_COEFF_HDR0_TX0
#define A2_COEFF_HDR0_TX0			0X4C ///< ADDRESS=76
#define A2_COEFF_HDR0_TX0_MSB			15
#define A2_COEFF_HDR0_TX0_LSB			0

//INITIALIZATION FOR REGISTER A3_COEFF_HDR0_TX0
#define A3_COEFF_HDR0_TX0			0X4D ///< ADDRESS=77
#define A3_COEFF_HDR0_TX0_MSB			15
#define A3_COEFF_HDR0_TX0_LSB			0

//INITIALIZATION FOR REGISTER A4_COEFF_HDR0_TX0
#define A4_COEFF_HDR0_TX0			0X4E ///< ADDRESS=78
#define A4_COEFF_HDR0_TX0_MSB			15
#define A4_COEFF_HDR0_TX0_LSB			0

//INITIALIZATION FOR REGISTER SCALE_NL_CORR_COEFF
#define SCALE_NL_CORR_COEFF			0X4A ///< ADDRESS=74
#define SCALE_NL_CORR_COEFF_MSB			19
#define SCALE_NL_CORR_COEFF_LSB			18

//INITIALIZATION FOR REGISTER A0_COEFF_HDR0_TX0
#define A0_COEFF_HDR0_TX0			0X4A ///< ADDRESS=74
#define A0_COEFF_HDR0_TX0_MSB			17
#define A0_COEFF_HDR0_TX0_LSB			2

//INITIALIZATION FOR REGISTER A0_COEFF_HDR1_TX0
#define A0_COEFF_HDR1_TX0			0XA2 ///< ADDRESS=162
#define A0_COEFF_HDR1_TX0_MSB			15
#define A0_COEFF_HDR1_TX0_LSB			0

//INITIALIZATION FOR REGISTER A0_COEFF_HDR0_TX1
#define A0_COEFF_HDR0_TX1			0XA3 ///< ADDRESS=163
#define A0_COEFF_HDR0_TX1_MSB			15
#define A0_COEFF_HDR0_TX1_LSB			0

//INITIALIZATION FOR REGISTER A0_COEFF_HDR1_TX1
#define A0_COEFF_HDR1_TX1			0XA4 ///< ADDRESS=164
#define A0_COEFF_HDR1_TX1_MSB			15
#define A0_COEFF_HDR1_TX1_LSB			0

//INITIALIZATION FOR REGISTER A0_COEFF_HDR0_TX2
#define A0_COEFF_HDR0_TX2			0XA5 ///< ADDRESS=165
#define A0_COEFF_HDR0_TX2_MSB			15
#define A0_COEFF_HDR0_TX2_LSB			0

//INITIALIZATION FOR REGISTER A0_COEFF_HDR1_TX2
#define A0_COEFF_HDR1_TX2			0XA6 ///< ADDRESS=166
#define A0_COEFF_HDR1_TX2_MSB			15
#define A0_COEFF_HDR1_TX2_LSB			0

//INITIALIZATION FOR REGISTER A1_COEFF_HDR1_TX0
#define A1_COEFF_HDR1_TX0			0XA7 ///< ADDRESS=167
#define A1_COEFF_HDR1_TX0_MSB			15
#define A1_COEFF_HDR1_TX0_LSB			0

