Appiko/nrf5x-firmware/codebase/ti_opt3101/register_map.h
//INITIALIZATION FOR REGISTER A1_COEFF_HDR0_TX1
#define A1_COEFF_HDR0_TX1			0XA8 ///< ADDRESS=168
#define A1_COEFF_HDR0_TX1_MSB			15
#define A1_COEFF_HDR0_TX1_LSB			0

//INITIALIZATION FOR REGISTER A1_COEFF_HDR1_TX1
#define A1_COEFF_HDR1_TX1			0XA9 ///< ADDRESS=169
#define A1_COEFF_HDR1_TX1_MSB			15
#define A1_COEFF_HDR1_TX1_LSB			0

//INITIALIZATION FOR REGISTER A1_COEFF_HDR0_TX2
#define A1_COEFF_HDR0_TX2			0XAA ///< ADDRESS=170
#define A1_COEFF_HDR0_TX2_MSB			15
#define A1_COEFF_HDR0_TX2_LSB			0

//INITIALIZATION FOR REGISTER A1_COEFF_HDR1_TX2
#define A1_COEFF_HDR1_TX2			0XAB ///< ADDRESS=171
#define A1_COEFF_HDR1_TX2_MSB			15
#define A1_COEFF_HDR1_TX2_LSB			0

//INITIALIZATION FOR REGISTER A2_COEFF_HDR1_TX0
#define A2_COEFF_HDR1_TX0			0XAC ///< ADDRESS=172
#define A2_COEFF_HDR1_TX0_MSB			15
#define A2_COEFF_HDR1_TX0_LSB			0

//INITIALIZATION FOR REGISTER A2_COEFF_HDR0_TX1
#define A2_COEFF_HDR0_TX1			0XAD ///< ADDRESS=173
#define A2_COEFF_HDR0_TX1_MSB			15
#define A2_COEFF_HDR0_TX1_LSB			0

//INITIALIZATION FOR REGISTER A2_COEFF_HDR1_TX1
#define A2_COEFF_HDR1_TX1			0XAE ///< ADDRESS=174
#define A2_COEFF_HDR1_TX1_MSB			15
#define A2_COEFF_HDR1_TX1_LSB			0

//INITIALIZATION FOR REGISTER A2_COEFF_HDR0_TX2
#define A2_COEFF_HDR0_TX2			0XAF ///< ADDRESS=175
#define A2_COEFF_HDR0_TX2_MSB			15
#define A2_COEFF_HDR0_TX2_LSB			0

//INITIALIZATION FOR REGISTER A2_COEFF_HDR1_TX2
#define A2_COEFF_HDR1_TX2			0XB0 ///< ADDRESS=176
#define A2_COEFF_HDR1_TX2_MSB			15
#define A2_COEFF_HDR1_TX2_LSB			0

//INITIALIZATION FOR REGISTER A3_COEFF_HDR1_TX0
#define A3_COEFF_HDR1_TX0			0XB1 ///< ADDRESS=177
#define A3_COEFF_HDR1_TX0_MSB			15
#define A3_COEFF_HDR1_TX0_LSB			0

//INITIALIZATION FOR REGISTER A3_COEFF_HDR0_TX1
#define A3_COEFF_HDR0_TX1_1			0XA2 ///< ADDRESS=162
#define A3_COEFF_HDR0_TX1_MSB_1			23
#define A3_COEFF_HDR0_TX1_LSB_1			16
#define A3_COEFF_HDR0_TX1			0XA3 ///< ADDRESS=163
#define A3_COEFF_HDR0_TX1_MSB			23
#define A3_COEFF_HDR0_TX1_LSB			16

//INITIALIZATION FOR REGISTER A3_COEFF_HDR1_TX1
#define A3_COEFF_HDR1_TX1_1			0XA4 ///< ADDRESS=164
#define A3_COEFF_HDR1_TX1_MSB_1			23
#define A3_COEFF_HDR1_TX1_LSB_1			16
#define A3_COEFF_HDR1_TX1			0XA5 ///< ADDRESS=165
#define A3_COEFF_HDR1_TX1_MSB			23
#define A3_COEFF_HDR1_TX1_LSB			16

//INITIALIZATION FOR REGISTER A3_COEFF_HDR0_TX2
#define A3_COEFF_HDR0_TX2_1			0XA6 ///< ADDRESS=166
#define A3_COEFF_HDR0_TX2_MSB_1			23
#define A3_COEFF_HDR0_TX2_LSB_1			16
#define A3_COEFF_HDR0_TX2			0XA7 ///< ADDRESS=167
#define A3_COEFF_HDR0_TX2_MSB			23
#define A3_COEFF_HDR0_TX2_LSB			16

//INITIALIZATION FOR REGISTER A3_COEFF_HDR1_TX2
#define A3_COEFF_HDR1_TX2_1			0XA8 ///< ADDRESS=168
#define A3_COEFF_HDR1_TX2_MSB_1			23
#define A3_COEFF_HDR1_TX2_LSB_1			16
#define A3_COEFF_HDR1_TX2			0XA9 ///< ADDRESS=169
#define A3_COEFF_HDR1_TX2_MSB			23
#define A3_COEFF_HDR1_TX2_LSB			16

//INITIALIZATION FOR REGISTER A4_COEFF_HDR1_TX0
#define A4_COEFF_HDR1_TX0_1			0XAA ///< ADDRESS=170
#define A4_COEFF_HDR1_TX0_MSB_1			23
#define A4_COEFF_HDR1_TX0_LSB_1			16
#define A4_COEFF_HDR1_TX0			0XAB ///< ADDRESS=171
#define A4_COEFF_HDR1_TX0_MSB			23
#define A4_COEFF_HDR1_TX0_LSB			16

//INITIALIZATION FOR REGISTER A4_COEFF_HDR0_TX1
#define A4_COEFF_HDR0_TX1_1			0XAC ///< ADDRESS=172
#define A4_COEFF_HDR0_TX1_MSB_1			23
#define A4_COEFF_HDR0_TX1_LSB_1			16
#define A4_COEFF_HDR0_TX1			0XAD ///< ADDRESS=173
#define A4_COEFF_HDR0_TX1_MSB			23
#define A4_COEFF_HDR0_TX1_LSB			16

//INITIALIZATION FOR REGISTER A4_COEFF_HDR1_TX1
#define A4_COEFF_HDR1_TX1_1			0XAE ///< ADDRESS=174
#define A4_COEFF_HDR1_TX1_MSB_1			23
#define A4_COEFF_HDR1_TX1_LSB_1			16
#define A4_COEFF_HDR1_TX1			0XAF ///< ADDRESS=175
#define A4_COEFF_HDR1_TX1_MSB			23
#define A4_COEFF_HDR1_TX1_LSB			16

//INITIALIZATION FOR REGISTER A4_COEFF_HDR0_TX2
#define A4_COEFF_HDR0_TX2_1			0XB0 ///< ADDRESS=176
#define A4_COEFF_HDR0_TX2_MSB_1			23
#define A4_COEFF_HDR0_TX2_LSB_1			16
#define A4_COEFF_HDR0_TX2			0XB1 ///< ADDRESS=177
#define A4_COEFF_HDR0_TX2_MSB			23
#define A4_COEFF_HDR0_TX2_LSB			16

//INITIALIZATION FOR REGISTER A4_COEFF_HDR1_TX2
#define A4_COEFF_HDR1_TX2			0XB2 ///< ADDRESS=178
#define A4_COEFF_HDR1_TX2_MSB			15
#define A4_COEFF_HDR1_TX2_LSB			0

//INITIALIZATION FOR REGISTER TILLUM
#define TILLUM			0X04 ///< ADDRESS=4
#define TILLUM_MSB			19
#define TILLUM_LSB			8

//INITIALIZATION FOR REGISTER TSENS_SLAVE0
#define TSENS_SLAVE0			0X02 ///< ADDRESS=2
#define TSENS_SLAVE0_MSB			6
#define TSENS_SLAVE0_LSB			0

//INITIALIZATION FOR REGISTER TSENS_SLAVE1
#define TSENS_SLAVE1			0X02 ///< ADDRESS=2
#define TSENS_SLAVE1_MSB			13
#define TSENS_SLAVE1_LSB			7

//INITIALIZATION FOR REGISTER TSENS_SLAVE2
#define TSENS_SLAVE2			0X02 ///< ADDRESS=2
#define TSENS_SLAVE2_MSB			20
#define TSENS_SLAVE2_LSB			14

//INITIALIZATION FOR REGISTER CONFIG_TILLUM_MSB
#define CONFIG_TILLUM_MSB			0X07 ///< ADDRESS=7
#define CONFIG_TILLUM_MSB_MSB			23
#define CONFIG_TILLUM_MSB_LSB			20

//INITIALIZATION FOR REGISTER EN_TILLUM_12B
#define EN_TILLUM_12B			0X0D ///< ADDRESS=13
#define EN_TILLUM_12B_MSB			23
#define EN_TILLUM_12B_LSB			23

//INITIALIZATION FOR REGISTER TILLUM_UNSIGNED
#define TILLUM_UNSIGNED			0X04 ///< ADDRESS=4
#define TILLUM_UNSIGNED_MSB			23
#define TILLUM_UNSIGNED_LSB			23

//INITIALIZATION FOR REGISTER TEMP_AVG_ILLUM
#define TEMP_AVG_ILLUM			0X02 ///< ADDRESS=2
#define TEMP_AVG_ILLUM_MSB			23
#define TEMP_AVG_ILLUM_LSB			22

//INITIALIZATION FOR REGISTER EN_TSENS_READ_FVD
#define EN_TSENS_READ_FVD			0X03 ///< ADDRESS=3
#define EN_TSENS_READ_FVD_MSB			18
#define EN_TSENS_READ_FVD_LSB			18

//INITIALIZATION FOR REGISTER EN_TILLUM_READ
#define EN_TILLUM_READ			0X02 ///< ADDRESS=2
#define EN_TILLUM_READ_MSB			21
#define EN_TILLUM_READ_LSB			21

//INITIALIZATION FOR REGISTER EEPROM_READ_TRIG
#define EEPROM_READ_TRIG			0X01 ///< ADDRESS=1
#define EEPROM_READ_TRIG_MSB			0
#define EEPROM_READ_TRIG_LSB			0

//INITIALIZATION FOR REGISTER SWAP_READ_DATA
#define SWAP_READ_DATA			0X01 ///< ADDRESS=1
#define SWAP_READ_DATA_MSB			1
#define SWAP_READ_DATA_LSB			1

//INITIALIZATION FOR REGISTER EEPROM_START_REG_ADDR
#define EEPROM_START_REG_ADDR			0X01 ///< ADDRESS=1
#define EEPROM_START_REG_ADDR_MSB			16
#define EEPROM_START_REG_ADDR_LSB			9

