Appiko/nrf5x-firmware/codebase/ti_opt3101/register_map.h
//INITIALIZATION FOR REGISTER FRAME_VD_TRIG
#define FRAME_VD_TRIG			0X01 ///< ADDRESS=1
#define FRAME_VD_TRIG_MSB			17
#define FRAME_VD_TRIG_LSB			17

//INITIALIZATION FOR REGISTER I2C_TRIG_REG
#define I2C_TRIG_REG			0X01 ///< ADDRESS=1
#define I2C_TRIG_REG_MSB			18
#define I2C_TRIG_REG_LSB			18

//INITIALIZATION FOR REGISTER I2C_EN
#define I2C_EN			0X01 ///< ADDRESS=1
#define I2C_EN_MSB			19
#define I2C_EN_LSB			19

//INITIALIZATION FOR REGISTER I2C_RW
#define I2C_RW			0X01 ///< ADDRESS=1
#define I2C_RW_MSB			21
#define I2C_RW_LSB			20

//INITIALIZATION FOR REGISTER I2C_READ_DATA
#define I2C_READ_DATA			0X03 ///< ADDRESS=3
#define I2C_READ_DATA_MSB			7
#define I2C_READ_DATA_LSB			0

//INITIALIZATION FOR REGISTER I2C_WRITE_DATA1
#define I2C_WRITE_DATA1			0X03 ///< ADDRESS=3
#define I2C_WRITE_DATA1_MSB			16
#define I2C_WRITE_DATA1_LSB			9

//INITIALIZATION FOR REGISTER I2C_NUM_TRAN
#define I2C_NUM_TRAN			0X03 ///< ADDRESS=3
#define I2C_NUM_TRAN_MSB			17
#define I2C_NUM_TRAN_LSB			17

//INITIALIZATION FOR REGISTER EN_EEPROM_READ
#define EN_EEPROM_READ			0X01 ///< ADDRESS=1
#define EN_EEPROM_READ_MSB			23
#define EN_EEPROM_READ_LSB			23

//INITIALIZATION FOR REGISTER INIT_LOAD_DONE
#define INIT_LOAD_DONE			0X03 ///< ADDRESS=3
#define INIT_LOAD_DONE_MSB			8
#define INIT_LOAD_DONE_LSB			8

//INITIALIZATION FOR REGISTER ADDR_SLAVE_EEPROM
#define ADDR_SLAVE_EEPROM			0X01 ///< ADDRESS=1
#define ADDR_SLAVE_EEPROM_MSB			8
#define ADDR_SLAVE_EEPROM_LSB			2

//INITIALIZATION FOR REGISTER I2C_NUM_BYTES_TRAN1
#define I2C_NUM_BYTES_TRAN1			0X07 ///< ADDRESS=7
#define I2C_NUM_BYTES_TRAN1_MSB			17
#define I2C_NUM_BYTES_TRAN1_LSB			16

//INITIALIZATION FOR REGISTER I2C_NUM_BYTES_TRAN2
#define I2C_NUM_BYTES_TRAN2			0X05 ///< ADDRESS=5
#define I2C_NUM_BYTES_TRAN2_MSB			23
#define I2C_NUM_BYTES_TRAN2_LSB			22

//INITIALIZATION FOR REGISTER I2C_WRITE_DATA2
#define I2C_WRITE_DATA2			0X07 ///< ADDRESS=7
#define I2C_WRITE_DATA2_MSB			7
#define I2C_WRITE_DATA2_LSB			0

//INITIALIZATION FOR REGISTER I2C_SEL_READ_BYTES
#define I2C_SEL_READ_BYTES			0X07 ///< ADDRESS=7
#define I2C_SEL_READ_BYTES_MSB			19
#define I2C_SEL_READ_BYTES_LSB			18

//INITIALIZATION FOR REGISTER I2C_CONT_RW
#define I2C_CONT_RW			0X00 ///< ADDRESS=0
#define I2C_CONT_RW_MSB			6
#define I2C_CONT_RW_LSB			6

//INITIALIZATION FOR REGISTER DIS_OVLDET
#define DIS_OVLDET			0X65 ///< ADDRESS=101
#define DIS_OVLDET_MSB			23
#define DIS_OVLDET_LSB			23

//INITIALIZATION FOR REGISTER PROG_OVLDET_REFP
#define PROG_OVLDET_REFP			0X64 ///< ADDRESS=100
#define PROG_OVLDET_REFP_MSB			20
#define PROG_OVLDET_REFP_LSB			18

//INITIALIZATION FOR REGISTER PROG_OVLDET_REFM
#define PROG_OVLDET_REFM			0X64 ///< ADDRESS=100
#define PROG_OVLDET_REFM_MSB			23
#define PROG_OVLDET_REFM_LSB			21

//INITIALIZATION FOR REGISTER IAMB_MAX_SEL
#define IAMB_MAX_SEL			0X72 ///< ADDRESS=114
#define IAMB_MAX_SEL_MSB			7
#define IAMB_MAX_SEL_LSB			4

//INITIALIZATION FOR REGISTER TM_VREFP_DIODE
#define TM_VREFP_DIODE			0X6D ///< ADDRESS=109
#define TM_VREFP_DIODE_MSB			2
#define TM_VREFP_DIODE_LSB			0

//INITIALIZATION FOR REGISTER TM_VREFM_DIODE
#define TM_VREFM_DIODE			0X6D ///< ADDRESS=109
#define TM_VREFM_DIODE_MSB			5
#define TM_VREFM_DIODE_LSB			3

//INITIALIZATION FOR REGISTER GPO1_MUX_SEL
#define GPO1_MUX_SEL			0X78 ///< ADDRESS=120
#define GPO1_MUX_SEL_MSB			8
#define GPO1_MUX_SEL_LSB			6

//INITIALIZATION FOR REGISTER GPIO1_OBUF_EN
#define GPIO1_OBUF_EN			0X78 ///< ADDRESS=120
#define GPIO1_OBUF_EN_MSB			12
#define GPIO1_OBUF_EN_LSB			12

//INITIALIZATION FOR REGISTER GPIO1_IBUF_EN
#define GPIO1_IBUF_EN			0X78 ///< ADDRESS=120
#define GPIO1_IBUF_EN_MSB			13
#define GPIO1_IBUF_EN_LSB			13

//INITIALIZATION FOR REGISTER GPO2_MUX_SEL
#define GPO2_MUX_SEL			0X78 ///< ADDRESS=120
#define GPO2_MUX_SEL_MSB			11
#define GPO2_MUX_SEL_LSB			9

//INITIALIZATION FOR REGISTER GPIO2_OBUF_EN
#define GPIO2_OBUF_EN			0X78 ///< ADDRESS=120
#define GPIO2_OBUF_EN_MSB			15
#define GPIO2_OBUF_EN_LSB			15

//INITIALIZATION FOR REGISTER GPIO2_IBUF_EN
#define GPIO2_IBUF_EN			0X78 ///< ADDRESS=120
#define GPIO2_IBUF_EN_MSB			16
#define GPIO2_IBUF_EN_LSB			16

//INITIALIZATION FOR REGISTER GPO3_MUX_SEL
#define GPO3_MUX_SEL			0X78 ///< ADDRESS=120
#define GPO3_MUX_SEL_MSB			2
#define GPO3_MUX_SEL_LSB			0

//INITIALIZATION FOR REGISTER SEL_GP3_ON_SDAM
#define SEL_GP3_ON_SDAM			0X78 ///< ADDRESS=120
#define SEL_GP3_ON_SDAM_MSB			22
#define SEL_GP3_ON_SDAM_LSB			22

//INITIALIZATION FOR REGISTER DEALIAS_EN
#define DEALIAS_EN			0X71 ///< ADDRESS=113
#define DEALIAS_EN_MSB			1
#define DEALIAS_EN_LSB			1

//INITIALIZATION FOR REGISTER DEALIAS_FREQ
#define DEALIAS_FREQ			0X71 ///< ADDRESS=113
#define DEALIAS_FREQ_MSB			2
#define DEALIAS_FREQ_LSB			2

//INITIALIZATION FOR REGISTER SHIFT_ILLUM_PHASE
#define SHIFT_ILLUM_PHASE			0X71 ///< ADDRESS=113
#define SHIFT_ILLUM_PHASE_MSB			6
#define SHIFT_ILLUM_PHASE_LSB			3

//INITIALIZATION FOR REGISTER SHUT_CLOCKS
#define SHUT_CLOCKS			0X71 ///< ADDRESS=113
#define SHUT_CLOCKS_MSB			8
#define SHUT_CLOCKS_LSB			8

//INITIALIZATION FOR REGISTER INVERT_TG_CLK
#define INVERT_TG_CLK			0X71 ///< ADDRESS=113
#define INVERT_TG_CLK_MSB			9
#define INVERT_TG_CLK_LSB			9

//INITIALIZATION FOR REGISTER INVERT_AFE_CLK
#define INVERT_AFE_CLK			0X71 ///< ADDRESS=113
#define INVERT_AFE_CLK_MSB			11
#define INVERT_AFE_CLK_LSB			11

//INITIALIZATION FOR REGISTER DIS_ILLUM_CLK_TX
#define DIS_ILLUM_CLK_TX			0X71 ///< ADDRESS=113
#define DIS_ILLUM_CLK_TX_MSB			12
#define DIS_ILLUM_CLK_TX_LSB			12

//INITIALIZATION FOR REGISTER EN_ILLUM_CLK_GPIO
#define EN_ILLUM_CLK_GPIO			0X71 ///< ADDRESS=113
#define EN_ILLUM_CLK_GPIO_MSB			16
#define EN_ILLUM_CLK_GPIO_LSB			16

//INITIALIZATION FOR REGISTER ILLUM_CLK_GPIO_MODE
#define ILLUM_CLK_GPIO_MODE			0X71 ///< ADDRESS=113
#define ILLUM_CLK_GPIO_MODE_MSB			15
#define ILLUM_CLK_GPIO_MODE_LSB			15

