Appiko/nrf5x-firmware/codebase/ti_opt3101/register_map.h
//INITIALIZATION FOR REGISTER UNMASK_ILLUMEN_INTXTALK
#define UNMASK_ILLUMEN_INTXTALK			0X71 ///< ADDRESS=113
#define UNMASK_ILLUMEN_INTXTALK_MSB			17
#define UNMASK_ILLUMEN_INTXTALK_LSB			17

//INITIALIZATION FOR REGISTER TEMP_OFFSET
#define TEMP_OFFSET			0X6E ///< ADDRESS=110
#define TEMP_OFFSET_MSB			16
#define TEMP_OFFSET_LSB			8

//INITIALIZATION FOR REGISTER EN_TEMP_CONV
#define EN_TEMP_CONV			0X6E ///< ADDRESS=110
#define EN_TEMP_CONV_MSB			19
#define EN_TEMP_CONV_LSB			19

//INITIALIZATION FOR REGISTER DIS_GLB_PD_REFSYS
#define DIS_GLB_PD_REFSYS			0X76 ///< ADDRESS=118
#define DIS_GLB_PD_REFSYS_MSB			0
#define DIS_GLB_PD_REFSYS_LSB			0

//INITIALIZATION FOR REGISTER DIS_GLB_PD_TEMP_SENS
#define DIS_GLB_PD_TEMP_SENS			0X76 ///< ADDRESS=118
#define DIS_GLB_PD_TEMP_SENS_MSB			1
#define DIS_GLB_PD_TEMP_SENS_LSB			1

//INITIALIZATION FOR REGISTER DIS_GLB_PD_ILLUM_DRV
#define DIS_GLB_PD_ILLUM_DRV			0X76 ///< ADDRESS=118
#define DIS_GLB_PD_ILLUM_DRV_MSB			2
#define DIS_GLB_PD_ILLUM_DRV_LSB			2

//INITIALIZATION FOR REGISTER DIS_GLB_PD_AFE
#define DIS_GLB_PD_AFE			0X76 ///< ADDRESS=118
#define DIS_GLB_PD_AFE_MSB			3
#define DIS_GLB_PD_AFE_LSB			3

//INITIALIZATION FOR REGISTER DIS_GLB_PD_AFE_DAC
#define DIS_GLB_PD_AFE_DAC			0X76 ///< ADDRESS=118
#define DIS_GLB_PD_AFE_DAC_MSB			4
#define DIS_GLB_PD_AFE_DAC_LSB			4

//INITIALIZATION FOR REGISTER DIS_GLB_PD_AMB_DAC
#define DIS_GLB_PD_AMB_DAC			0X76 ///< ADDRESS=118
#define DIS_GLB_PD_AMB_DAC_MSB			5
#define DIS_GLB_PD_AMB_DAC_LSB			5

//INITIALIZATION FOR REGISTER DIS_GLB_PD_AMB_ADC
#define DIS_GLB_PD_AMB_ADC			0X76 ///< ADDRESS=118
#define DIS_GLB_PD_AMB_ADC_MSB			6
#define DIS_GLB_PD_AMB_ADC_LSB			6

//INITIALIZATION FOR REGISTER DIS_GLB_PD_TEST_CURR
#define DIS_GLB_PD_TEST_CURR			0X76 ///< ADDRESS=118
#define DIS_GLB_PD_TEST_CURR_MSB			7
#define DIS_GLB_PD_TEST_CURR_LSB			7

//INITIALIZATION FOR REGISTER DIS_GLB_PD_OSC
#define DIS_GLB_PD_OSC			0X76 ///< ADDRESS=118
#define DIS_GLB_PD_OSC_MSB			8
#define DIS_GLB_PD_OSC_LSB			8

//INITIALIZATION FOR REGISTER DIS_GLB_PD_I2CHOST
#define DIS_GLB_PD_I2CHOST			0X76 ///< ADDRESS=118
#define DIS_GLB_PD_I2CHOST_MSB			9
#define DIS_GLB_PD_I2CHOST_LSB			9

//INITIALIZATION FOR REGISTER PDN_GLOBAL
#define PDN_GLOBAL			0X76 ///< ADDRESS=118
#define PDN_GLOBAL_MSB			11
#define PDN_GLOBAL_LSB			11

//INITIALIZATION FOR REGISTER EN_DYN_PD_REFSYS
#define EN_DYN_PD_REFSYS			0X77 ///< ADDRESS=119
#define EN_DYN_PD_REFSYS_MSB			0
#define EN_DYN_PD_REFSYS_LSB			0

//INITIALIZATION FOR REGISTER EN_DYN_PD_TEMP_SENS
#define EN_DYN_PD_TEMP_SENS			0X77 ///< ADDRESS=119
#define EN_DYN_PD_TEMP_SENS_MSB			1
#define EN_DYN_PD_TEMP_SENS_LSB			1

//INITIALIZATION FOR REGISTER EN_DYN_PD_ILLUM_DRV
#define EN_DYN_PD_ILLUM_DRV			0X77 ///< ADDRESS=119
#define EN_DYN_PD_ILLUM_DRV_MSB			2
#define EN_DYN_PD_ILLUM_DRV_LSB			2

//INITIALIZATION FOR REGISTER EN_DYN_PD_AFE
#define EN_DYN_PD_AFE			0X77 ///< ADDRESS=119
#define EN_DYN_PD_AFE_MSB			3
#define EN_DYN_PD_AFE_LSB			3

//INITIALIZATION FOR REGISTER EN_DYN_PD_AFE_DAC
#define EN_DYN_PD_AFE_DAC			0X77 ///< ADDRESS=119
#define EN_DYN_PD_AFE_DAC_MSB			4
#define EN_DYN_PD_AFE_DAC_LSB			4

//INITIALIZATION FOR REGISTER EN_DYN_PD_AMB_DAC
#define EN_DYN_PD_AMB_DAC			0X77 ///< ADDRESS=119
#define EN_DYN_PD_AMB_DAC_MSB			5
#define EN_DYN_PD_AMB_DAC_LSB			5

//INITIALIZATION FOR REGISTER EN_DYN_PD_AMB_ADC
#define EN_DYN_PD_AMB_ADC			0X77 ///< ADDRESS=119
#define EN_DYN_PD_AMB_ADC_MSB			6
#define EN_DYN_PD_AMB_ADC_LSB			6

//INITIALIZATION FOR REGISTER EN_DYN_PD_TEST_CURR
#define EN_DYN_PD_TEST_CURR			0X77 ///< ADDRESS=119
#define EN_DYN_PD_TEST_CURR_MSB			7
#define EN_DYN_PD_TEST_CURR_LSB			7

//INITIALIZATION FOR REGISTER EN_DYN_PD_OSC
#define EN_DYN_PD_OSC			0X77 ///< ADDRESS=119
#define EN_DYN_PD_OSC_MSB			8
#define EN_DYN_PD_OSC_LSB			8

//INITIALIZATION FOR REGISTER EN_DYN_PD_I2CHOST_OSC
#define EN_DYN_PD_I2CHOST_OSC			0X77 ///< ADDRESS=119
#define EN_DYN_PD_I2CHOST_OSC_MSB			9
#define EN_DYN_PD_I2CHOST_OSC_LSB			9

//INITIALIZATION FOR REGISTER TX0_PIN_CONFIG
#define TX0_PIN_CONFIG			0X7A ///< ADDRESS=122
#define TX0_PIN_CONFIG_MSB			5
#define TX0_PIN_CONFIG_LSB			4

//INITIALIZATION FOR REGISTER TX1_PIN_CONFIG
#define TX1_PIN_CONFIG			0X7A ///< ADDRESS=122
#define TX1_PIN_CONFIG_MSB			1
#define TX1_PIN_CONFIG_LSB			0

//INITIALIZATION FOR REGISTER TX2_PIN_CONFIG
#define TX2_PIN_CONFIG			0X7A ///< ADDRESS=122
#define TX2_PIN_CONFIG_MSB			3
#define TX2_PIN_CONFIG_LSB			2

//INITIALIZATION FOR REGISTER EN_TX_CLKB
#define EN_TX_CLKB			0X79 ///< ADDRESS=121
#define EN_TX_CLKB_MSB			0
#define EN_TX_CLKB_LSB			0

//INITIALIZATION FOR REGISTER EN_TX_CLKZ
#define EN_TX_CLKZ			0X79 ///< ADDRESS=121
#define EN_TX_CLKZ_MSB			2
#define EN_TX_CLKZ_LSB			2

//INITIALIZATION FOR REGISTER SEL_ILLUM_TX0_ON_TX1
#define SEL_ILLUM_TX0_ON_TX1			0X79 ///< ADDRESS=121
#define SEL_ILLUM_TX0_ON_TX1_MSB			3
#define SEL_ILLUM_TX0_ON_TX1_LSB			3

//INITIALIZATION FOR REGISTER ILLUM_DC_CURR_DAC
#define ILLUM_DC_CURR_DAC			0X79 ///< ADDRESS=121
#define ILLUM_DC_CURR_DAC_MSB			11
#define ILLUM_DC_CURR_DAC_LSB			8

//INITIALIZATION FOR REGISTER PDN_ILLUM_DC_CURR
#define PDN_ILLUM_DC_CURR			0X79 ///< ADDRESS=121
#define PDN_ILLUM_DC_CURR_MSB			12
#define PDN_ILLUM_DC_CURR_LSB			12

//INITIALIZATION FOR REGISTER FEEDBACK_CONT_MODE
#define FEEDBACK_CONT_MODE			0X79 ///< ADDRESS=121
#define FEEDBACK_CONT_MODE_MSB			13
#define FEEDBACK_CONT_MODE_LSB			13

//INITIALIZATION FOR REGISTER PDN_ILLUM_DRV
#define PDN_ILLUM_DRV			0X79 ///< ADDRESS=121
#define PDN_ILLUM_DRV_MSB			19
#define PDN_ILLUM_DRV_LSB			19

//INITIALIZATION FOR REGISTER EN_TX_DC_CURR_ALL
#define EN_TX_DC_CURR_ALL			0X79 ///< ADDRESS=121
#define EN_TX_DC_CURR_ALL_MSB			4

#endif //OPT3101_REGISTER_MAP_H
